nix-adventures-01.org
#+title:     Nix Adventures (part 1 of ?)
#+author:    Logan Barnett
#+email:     logustus@gmail.com
#+date:      <2023-12-22 Fri>
#+language:  en
#+file_tags:
#+tags:
#+auto_id:   t
#+options:   toc:nil

#+BEGIN_EXPORT html
---
categories: nix
date: 2023-12-22
layout: default
title: Nix Adventures (part 1 of ?)
---
#+END_EXPORT

* What is this?
:PROPERTIES:
:CUSTOM_ID: what-is-this
:END:

I recently (re?)read some posts from [[https://ianthehenry.com/posts/how-to-learn-nix/][Ian Henry's own adventures with Nix]]. I find
the series both amusing (because watching someone suffer as I have suffered can
be amusing if done well), and because it's actually encouraging to see someone
actually struggling with this.  Nix feels a lot like Rust to me.  In many ways
it represents the future of computing.  In others, I see a select few people
with _deep_ understanding of the topic spouting off what is the equivalent of
total nonsense to me.  I am glad these people are helping, and I am positive
they are 100% correct in their statements.  I just don't understand any of it.
There's some knowledge I was supposed to acquire while ~~skimming~~ reading
through a colossal set of documentation.

Now, before this goes further, I want to make it really clear here:  I fully
understand and appreciate for most people working on these projects that it's a
passion project and open source burnout is very real.  Posts like Ian's and now
mine walk a dangerous line of contributing to that burnout.  I will make immense
effort to keep my observations tasteful and respectful, while still capturing a
degree of frustration so that maybe someone will have an experience similar to
mine as I read Ian's posts.

I tried finding the origin to this, but Google really has been letting me down
lately.  Likely paraphrased, it goes like this:

#+begin_quote
There are two kinds of things in the world: Things people complain about, and
things nobody has heard of.
#+end_quote

That Nix now has at least two blog series on this topic speaks well of Nix, its
promise, and its progress.

* Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:

As is stamped all over this blog, I am Logan Barnett.  I like working with
computers more than working with humans, and I've been doing it for a while now.
There are significant gaps in my knowledge and I am comfortable with that.  I
have a penchant for functional programming, documentation of all kinds, and
overall I want the computer to work for me, not the other way around.  I have a
[[file:./resume.org][resume]] if you want to get into more specifics of my technical background.

* Nix Thus Far
:PROPERTIES:
:CUSTOM_ID: nix-thus-far
:END:

I have been using Nix for well over a year at time of writing.  Since then I
have moved to using Nix with Home-manager, and now some combination of
Home-manager and Flakes that still puzzles me.  I use it extensively for
managing [[https://github.com/LoganBarnett/dotfiles][my machine's local configuration]] (historically "dotfiles").  I also use
it for managing repository dependencies (a generalized version of =tfswitch=,
=rbenv=, =pyenv=, =nodenv=, etc).  I always have to look up how to make a
derivation or even the simplest overlay.

I've gotten to the point where installing my settings on a new machine requires
very little adjusting.  A vast majority of my local software is governed by Nix.
The only thing I'm truly missing is Homebrew's =cask= functionality, and that's
mostly because =Alfred.app= refuses to follow symlinks as a design decision (I
plan to rectify that eventually).

I am getting to the point where I can make my own derivations that simply follow
build-from-source instructions on a =README=.

* Today's Project: Working on a Raspberry Pi
:PROPERTIES:
:CUSTOM_ID: today's-project:-working-on-a-raspberry-pi
:END:

I have some work I want to do on a Raspberry Pi involving Wireguard.  I have
some prior experience with Wireguard and also with working on Raspberry Pis.
I have a complication: I have no displays nor display adapters (micro-HDMI) with
which I could use to interface with the Pi.  I have no extra keyboard or mouse
at the moment.  For a system I should be able build an image for, this kind of
hardware requirement really seems like overkill.

=sshd= is disabled by default on a Raspberry Pi, so I cannot =ssh= to it, even
if I could find it on a local link (this would take hours because =nmap= is
pretty slow at this).

So my next best activity is to either build the image in the state I want it in,
or edit the files on the SD card whose state is setup by a pre-built image.  I
have a pre-built image already, and I'm on macOS.  Being on macOS prevents me
from building new Linux images of any kind without a Docker image (which needs a
VM) or setting up a Linux VM (which needs a VM too, ha!).  My bandwidth is low,
as is my disk space.  I can solve the disk space issue, but that's a project for
another day.

In comes a tool called =macfuse=, previously known as =osxfuse=.  They followed the
rebrand that Apple did, apparently.  I've learned recently that this tool no
longer requires disabling the SIP on macOS, which I have found to be a
deal-breaker for my standards.  It's just a user-land kernel extension.  I don't
know who to thank for that, but I am grateful for it.

* Somehow Write to the Pi SD card
:PROPERTIES:
:CUSTOM_ID: somehow-write-to-the-pi-sd-card
:END:

Whether I have some way to bake an image in the desired state (such as with a
fixed IP for link-local and =sshd= enabled), or I just edit the SD card directly
doesn't strictly matter to me.  Because I wanted to keep things "simple", I
elected to just go for the edits directly on what I believe is an already
functional SD card, and save the NixOS-on-Pi activity for another day.

