nix-adventures-01.html
---
categories: nix
date: 2023-12-22
layout: default
title: Nix Adventures (part 1 of ?)
---
<div id="outline-container-what-is-this" class="outline-2">
<h2 id="what-is-this"><span class="section-number-2">1.</span> What is this?</h2>
<div class="outline-text-2" id="text-what-is-this">
<p>
I recently (re?)read some posts from <a href="https://ianthehenry.com/posts/how-to-learn-nix/">Ian Henry&rsquo;s own adventures with Nix</a>. I find
the series both amusing (because watching someone suffer as I have suffered can
be amusing if done well), and because it&rsquo;s actually encouraging to see someone
actually struggling with this.  Nix feels a lot like Rust to me.  In many ways
it represents the future of computing.  In others, I see a select few people
with <span class="underline">deep</span> understanding of the topic spouting off what is the equivalent of
total nonsense to me.  I am glad these people are helping, and I am positive
they are 100% correct in their statements.  I just don&rsquo;t understand any of it.
There&rsquo;s some knowledge I was supposed to acquire while <del>skimming</del> reading
through a colossal set of documentation.
</p>

<p>
Now, before this goes further, I want to make it really clear here:  I fully
understand and appreciate for most people working on these projects that it&rsquo;s a
passion project and open source burnout is very real.  Posts like Ian&rsquo;s and now
mine walk a dangerous line of contributing to that burnout.  I will make immense
effort to keep my observations tasteful and respectful, while still capturing a
degree of frustration so that maybe someone will have an experience similar to
mine as I read Ian&rsquo;s posts.
</p>

<p>
I tried finding the origin to this, but Google really has been letting me down
lately.  Likely paraphrased, it goes like this:
</p>

<blockquote>
<p>
There are two kinds of things in the world: Things people complain about, and
things nobody has heard of.
</p>
</blockquote>

<p>
That Nix now has at least two blog series on this topic speaks well of Nix, its
promise, and its progress.
</p>
</div>
</div>
<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">2.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
As is stamped all over this blog, I am Logan Barnett.  I like working with
computers more than working with humans, and I&rsquo;ve been doing it for a while now.
There are significant gaps in my knowledge and I am comfortable with that.  I
have a penchant for functional programming, documentation of all kinds, and
overall I want the computer to work for me, not the other way around.  I have a
<a href="./resume.html">resume</a> if you want to get into more specifics of my technical background.
</p>
</div>
</div>
<div id="outline-container-nix-thus-far" class="outline-2">
<h2 id="nix-thus-far"><span class="section-number-2">3.</span> Nix Thus Far</h2>
<div class="outline-text-2" id="text-nix-thus-far">
<p>
I have been using Nix for well over a year at time of writing.  Since then I
have moved to using Nix with Home-manager, and now some combination of
Home-manager and Flakes that still puzzles me.  I use it extensively for
managing <a href="https://github.com/LoganBarnett/dotfiles">my machine&rsquo;s local configuration</a> (historically &ldquo;dotfiles&rdquo;).  I also use
it for managing repository dependencies (a generalized version of <code>tfswitch</code>,
<code>rbenv</code>, <code>pyenv</code>, <code>nodenv</code>, etc).  I always have to look up how to make a
derivation or even the simplest overlay.
</p>

<p>
I&rsquo;ve gotten to the point where installing my settings on a new machine requires
very little adjusting.  A vast majority of my local software is governed by Nix.
The only thing I&rsquo;m truly missing is Homebrew&rsquo;s <code>cask</code> functionality, and that&rsquo;s
mostly because <code>Alfred.app</code> refuses to follow symlinks as a design decision (I
plan to rectify that eventually).
</p>

<p>
I am getting to the point where I can make my own derivations that simply follow
build-from-source instructions on a <code>README</code>.
</p>
</div>
</div>
<div id="outline-container-today's-project:-working-on-a-raspberry-pi" class="outline-2">
<h2 id="today's-project:-working-on-a-raspberry-pi"><span class="section-number-2">4.</span> Today&rsquo;s Project: Working on a Raspberry Pi</h2>
<div class="outline-text-2" id="text-today's-project:-working-on-a-raspberry-pi">
<p>
I have some work I want to do on a Raspberry Pi involving Wireguard.  I have
some prior experience with Wireguard and also with working on Raspberry Pis.
I have a complication: I have no displays nor display adapters (micro-HDMI) with
which I could use to interface with the Pi.  I have no extra keyboard or mouse
at the moment.  For a system I should be able build an image for, this kind of
hardware requirement really seems like overkill.
</p>

<p>
<code>sshd</code> is disabled by default on a Raspberry Pi, so I cannot <code>ssh</code> to it, even
if I could find it on a local link (this would take hours because <code>nmap</code> is
pretty slow at this).
</p>

<p>
So my next best activity is to either build the image in the state I want it in,
or edit the files on the SD card whose state is setup by a pre-built image.  I
have a pre-built image already, and I&rsquo;m on macOS.  Being on macOS prevents me
from building new Linux images of any kind without a Docker image (which needs a
VM) or setting up a Linux VM (which needs a VM too, ha!).  My bandwidth is low,
as is my disk space.  I can solve the disk space issue, but that&rsquo;s a project for
another day.
</p>

<p>
In comes a tool called <code>macfuse</code>, previously known as <code>osxfuse</code>.  They followed the
rebrand that Apple did, apparently.  I&rsquo;ve learned recently that this tool no
longer requires disabling the SIP on macOS, which I have found to be a
deal-breaker for my standards.  It&rsquo;s just a user-land kernel extension.  I don&rsquo;t
know who to thank for that, but I am grateful for it.
</p>
</div>
</div>
<div id="outline-container-somehow-write-to-the-pi-sd-card" class="outline-2">
<h2 id="somehow-write-to-the-pi-sd-card"><span class="section-number-2">5.</span> Somehow Write to the Pi SD card</h2>
<div class="outline-text-2" id="text-somehow-write-to-the-pi-sd-card">
<p>
Whether I have some way to bake an image in the desired state (such as with a
fixed IP for link-local and <code>sshd</code> enabled), or I just edit the SD card directly
doesn&rsquo;t strictly matter to me.  Because I wanted to keep things &ldquo;simple&rdquo;, I
elected to just go for the edits directly on what I believe is an already
functional SD card, and save the NixOS-on-Pi activity for another day.
</p>
</div>
