nix-adventures-01.org
** Empower Editing SD Card Files from macOS Directly
:PROPERTIES:
:CUSTOM_ID: somehow-write-to-the-pi-sd-card--empower-editing-sd-card-files-from-macos-directly
:END:

First, getting =macfuse= setup on my system via Nix isn't something directly
supported.  I had to go into the Nix derivation for =e2fsprogs= and remove the
guards against running on =darwin=.  Additionally I found =e2fsprogs= doesn't
even compile.  =setxattr= and =getxattr= can't be assigned to because the
function signatures don't match.  So I make them match with best guess by adding
some parameters and declaring a couple of others as unsigned (link will come to
the commit by the time I publish).  I believe this is because =osxfuse= has some
differences in the API, or perhaps there are version incompatibilities.  It
builds after that.  I struggle with =nix-flakes= for a bit but eventually I
notice that =fuse-ext2= is indeed on my =PATH= - but I'm not certain which of my
incantations brought it about.  I'm still very new to =nix-flakes= and much of
it was forced upon me from other things I desired.  I basically jumped in the
cockpit seat of the =nix-flakes= plane and grabbed the stick, hoping for the
best.  I haven't collided with the planet Earth yet but there's still time for
that.

I try to mount my disk with invocations such as these:

#+begin_src shell :results none :exports code
sudo fuse-ext2 /dev/disk4s1 /Volumes/4s1
sudo fuse-ext2 /dev/disk4s2 /Volumes/4s2
#+end_src

Because I don't know which one is which and there are only two partitions for
=disk4=.

I don't have the exact message or dialog screenshots unfortunately, but this is
where I find out that I indeed need to disable SIP (System Integrity
Protection).  This involves rebooting the system into recovery mode, firing up
the terminal there, and running =csrutil disable=.  =uptime= reports I'm at 70
days - a lot of days earned via hard won knowledge on battery draining
activities on my laptop (such as bluetooth).  My pride suffers a blow, but I
sally forth.  Then I spend about 7 reboots or so trying to get my laptop to
actually boot into recovery mode.

macOS has changed their reboot key bindings more than they've changed their
power adapter connections, and that's saying a lot.  Naturally I searched for
how to do this, and was happy with the holding of =Cmd+R= during the boot-up.
It doesn't work, which in my experience means the timing is wrong, so I try it
several more time.  The technical timing is important so I try it more than
once, which is how we wind up with me going to 7.  The 7th attempt was me
finding out those instructions were for _Intel_ Macs and I'm on Apple Silicon.
Right - glad we have that distinguishment.  My mind immediately demands "Why?
Why make these different?" but answers I can come up with are depressing in a
very literal way.

I do the =csrutil disable= which prompts me but works anyways.  Knowing I have
done the nasty successfully and my work here is done, I reboot to go back to my
normal runtime.  I attempt to mount again with:

#+begin_src shell :results none :exports code
sudo fuse-ext2 /dev/disk4s2 /Volumes/4s2
#+end_src

But again am prompted - my Mac tells me it has blocked the kernel extension, and
I must reboot to bless it.  Great.  Couldn't we have just done that earlier?  Or
maybe just let me queue up here at least so I don't need to go into a mode where
I can't call upon my lifelines for help.  Alas, more reboots ahoy.  At least
this time they give me really vague instructions.  This probably would've
confused me into doing more reboots and searching, but I've already been here.
Now that I've blessed this kernel extension from Benjamin (who is that?), I go
back to try it again.  Still blocked.  The System Settings section tells me
there's a kernel extension that needs to be blessed - it doesn't give me
indication that I've blessed anything already.  Ugh.  Why is this such a
miserable experience?  Again I reboot into recovery mode, bring up the Security
Utility, and bless the kernel extension.  This time it goes away.  I was
operating in the suspicion that there might be more than one kernel extension
involved, and all of them must be blessed individually.

Now I try again.  I have some vague memory that mount processes don't typically
create the actual mount point directory in Linux, so I assume it's the same
here.

#+begin_src shell :results none :exports code :cache yes
sudo mkdir /Volumes/4s2
sudo fuse-ext2 /dev/disk4s2 /Volumes/4s2
#+end_src

Nothing happens.  The directory is empty and I have exit code 253 from
=fuse-ext2= (having your prompt show the last exit code is so incredibly
useful).  What's 253 mean?  I check the man page - nothing.  From searching on
other people trying things out, I add a =-o debug= to the invocation.  No
output, same code. I add =-v= to the front of the from/to arguments.  No change
in output/code.  I worry this is resulting from my hack earlier to =e2fsprogs=.
But I would expect to see _something_ here.  There is mention of a
=/var/log/fuse-ext2_util.log= in some tickets I see, but I don't have that.

I try:

#+begin_src shell :results output :exports both :cache yes
sudo mount -t fuse-ext2 /dev/disk4s2 /Volumes/4s2
#+end_src

:RESULTS:
mount: exec /Library/Filesystems/fuse-ext2.fs/Contents/Resources/mount_fuse-ext2 for /Volumes/4s2: No such file or directory
mount: /Volumes/4s2 failed with 72
:END:

The =No such file or directory= portion can't be correct on the latter path -
=/Volumes/4s2= exists.  I check the =/Library/Filesystems/...= path and it is
indeed non-existent.  Curious, looking in =/Library/Filesystems= directly shows
me _something_ of relevance:

#+begin_src shell :results output :exports both :cache yes
ls /Library/Filesystems
#+end_src

#+RESULTS:
: NetFSPlugins
: macfuse.fs

So I try this modified =mount=:

#+begin_src shell :results output :exports both :cache yes
sudo mount -t macfuse.fs /dev/disk4s2 /Volumes/4s2
#+end_src

:RESULTS:
macFUSE mount version 4.5.0

This program is not meant to be called directly. The macFUSE library calls it.

Available mount options:
    -o allow_other         allow access to others besides the user who mounted
                           the file system
    -o allow_recursion     allow a mount point that itself resides on a macFUSE
                           volume (by default, such mounting is disallowed)
    -o allow_root          allow access to root (can't be used with allow_other)
    -o auto_xattr          handle extended attributes entirely through ._ files
    -o blocksize=<size>    specify block size in bytes of "storage"
    -o daemon_timeout=<s>  timeout in seconds for kernel calls to daemon
    -o debug               turn on debug information printing
    -o default_permissions let the kernel handle permission checks locally
    -o defer_permissions   defer permission checks to file operations themselves
    -o direct_io           use alternative (direct) path for kernel-user I/O
    -o extended_security   turn on macOS extended security (ACLs)
    -o fsid=<fsid>         set the second 32-bit component of the fsid
    -o fsname=<name>       set the file system's name
    -o fssubtype=<num>     set the file system's fssubtype identifier
    -o fstypename=<name>   set the file system's type name
    -o iosize=<size>       specify maximum I/O size in bytes
    -o jail_symlinks       contain symbolic links within the mount
    -o local               mark the volume as "local" (default is "nonlocal")
    -o negative_vncache    enable vnode name caching of non-existent objects
    -o sparse              enable support for sparse files
    -o volname=<name>      set the file system's volume name

Available negative mount options:
    -o noalerts            disable all graphical alerts (if any) in macFUSE Core
    -o noappledouble       ignore Apple Double (._) and .DS_Store files entirely
    -o noapplexattr        ignore all "com.apple.*" extended attributes
    -o nobrowse            mark the volume as non-browsable by the Finder
    -o nolocalcaches       meta option equivalent to noreadahead,noubc,novncache
    -o noreadahead         disable I/O read-ahead behavior for this file system
    -o nosynconclose       disable sync-on-close behavior (enabled by default)
    -o nosyncwrites        disable synchronous-writes behavior (dangerous)
    -o noubc               disable the unified buffer cache for this file system
    -o novncache           disable the vnode name cache for this file system
mount: /Volumes/4s2 failed with 64
:END:

So =mount= is looking less promising.  This appears to be =mount= just spewing
the usage information of =macfuse= because it is giving =macfuse= an erroneous
invocation.  Is this intended to ever work?  I found this invocation from other
lost souls who were experiencing no luck here as well, so it might not mean
much.

Following some other tickets, I want to just confirm that everything I have is
in order.  Oftentimes errors come from the user, not the software.  I find =sudo
diskutil list= gives some good answers.

#+begin_example
<snip>
/dev/disk6 (internal, physical):
   #:                       TYPE NAME                    SIZE       IDENTIFIER
   0:     FDisk_partition_scheme                        *127.9 GB   disk6
   1:                 DOS_FAT_32 FIRMWARE                31.5 MB    disk6s1
   2:                      Linux                         127.8 GB   disk6s2
#+end_example

I have been operating with the notion that I was using =disk4=, but between
reboots and swapping the physical card out to stow my laptop between attempts,
it must have moved.  Sigh.  Let's do this again.  At least I know with
confidence that I want to be mounting the "2" partition.

#+begin_src shell :results none :exports code
sudo fuse-ext2 /dev/disk6s2 /Volumes/4s2
#+end_src

I didn't rename the directory to a matching =6s2= because I just want to _try_
something.  Results are promising and with a delay:

#+begin_example
Mounting /dev/disk6s2 Read-Only.
Use 'force' or 'rw+' options to enable Read-Write mode
#+end_example

And then:

#+begin_src shell :results output :exports code :cache yes
ls /Volumes/4s2
#+end_src

#+RESULTS[260f8515aac0e18dbcc8dc13599b92ea170b93ee]:
#+begin_example
bin
boot
dev
etc
home
lost+found
mnt
nix
proc
root
run
srv
sys
tmp
usr
var
#+end_example

Wow something worked!  I'm going to treat myself.

Now let's clean up the directory name, and make it read+write.

#+begin_src shell :results none :exports code
sudo umount /Volumes/4s2
sudo mv /Volumes/{4,6}s2
sudo fuse-ext2 -o rw+ /dev/disk6s2 /Volumes/4s2
#+end_src

Actually just trying to scroll through some shell history wound up making the
machine unusable, and it eventually necessitated a reboot.  I've lost any
home-made directories under =/Volume= and so I can just make them the way I want
them.  I am a little worried that maybe my hacks I made to =g2fsprogs= have
introduced some critical instability to my kernel, but I fail to see how the
=xattrs= stuff would have anything to do with my shell history.  Perhaps it's
due to some =zsh= magic?

The commands again, and note that now we're back to =disk4=:

#+begin_src shell :results none :exports code
sudo mkdir /Volumes/picard
sudo fuse-ext2 -o rw+ /dev/disk4s2 /Volumes/picard
#+end_src

And that worked!  Now to make edits to the card.

