nix-adventures-01.html
<div id="outline-container-somehow-write-to-the-pi-sd-card--empower-editing-sd-card-files-from-macos-directly" class="outline-3">
<h3 id="somehow-write-to-the-pi-sd-card--empower-editing-sd-card-files-from-macos-directly"><span class="section-number-3">5.1.</span> Empower Editing SD Card Files from macOS Directly</h3>
<div class="outline-text-3" id="text-somehow-write-to-the-pi-sd-card--empower-editing-sd-card-files-from-macos-directly">
<p>
First, getting <code>macfuse</code> setup on my system via Nix isn&rsquo;t something directly
supported.  I had to go into the Nix derivation for <code>e2fsprogs</code> and remove the
guards against running on <code>darwin</code>.  Additionally I found <code>e2fsprogs</code> doesn&rsquo;t
even compile.  <code>setxattr</code> and <code>getxattr</code> can&rsquo;t be assigned to because the
function signatures don&rsquo;t match.  So I make them match with best guess by adding
some parameters and declaring a couple of others as unsigned (link will come to
the commit by the time I publish).  I believe this is because <code>osxfuse</code> has some
differences in the API, or perhaps there are version incompatibilities.  It
builds after that.  I struggle with <code>nix-flakes</code> for a bit but eventually I
notice that <code>fuse-ext2</code> is indeed on my <code>PATH</code> - but I&rsquo;m not certain which of my
incantations brought it about.  I&rsquo;m still very new to <code>nix-flakes</code> and much of
it was forced upon me from other things I desired.  I basically jumped in the
cockpit seat of the <code>nix-flakes</code> plane and grabbed the stick, hoping for the
best.  I haven&rsquo;t collided with the planet Earth yet but there&rsquo;s still time for
that.
</p>

<p>
I try to mount my disk with invocations such as these:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orge34ab73"><span style="color: #FCCE7B;">sudo</span> fuse-ext2 /dev/disk4s1 /Volumes/4s1
<span style="color: #FCCE7B;">sudo</span> fuse-ext2 /dev/disk4s2 /Volumes/4s2
</pre>
</div>

<p>
Because I don&rsquo;t know which one is which and there are only two partitions for
<code>disk4</code>.
</p>

<p>
I don&rsquo;t have the exact message or dialog screenshots unfortunately, but this is
where I find out that I indeed need to disable SIP (System Integrity
Protection).  This involves rebooting the system into recovery mode, firing up
the terminal there, and running <code>csrutil disable</code>.  <code>uptime</code> reports I&rsquo;m at 70
days - a lot of days earned via hard won knowledge on battery draining
activities on my laptop (such as bluetooth).  My pride suffers a blow, but I
sally forth.  Then I spend about 7 reboots or so trying to get my laptop to
actually boot into recovery mode.
</p>

<p>
macOS has changed their reboot key bindings more than they&rsquo;ve changed their
power adapter connections, and that&rsquo;s saying a lot.  Naturally I searched for
how to do this, and was happy with the holding of <code>Cmd+R</code> during the boot-up.
It doesn&rsquo;t work, which in my experience means the timing is wrong, so I try it
several more time.  The technical timing is important so I try it more than
once, which is how we wind up with me going to 7.  The 7th attempt was me
finding out those instructions were for <span class="underline">Intel</span> Macs and I&rsquo;m on Apple Silicon.
Right - glad we have that distinguishment.  My mind immediately demands &ldquo;Why?
Why make these different?&rdquo; but answers I can come up with are depressing in a
very literal way.
</p>

<p>
I do the <code>csrutil disable</code> which prompts me but works anyways.  Knowing I have
done the nasty successfully and my work here is done, I reboot to go back to my
normal runtime.  I attempt to mount again with:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org75dc086"><span style="color: #FCCE7B;">sudo</span> fuse-ext2 /dev/disk4s2 /Volumes/4s2
</pre>
</div>

<p>
But again am prompted - my Mac tells me it has blocked the kernel extension, and
I must reboot to bless it.  Great.  Couldn&rsquo;t we have just done that earlier?  Or
maybe just let me queue up here at least so I don&rsquo;t need to go into a mode where
I can&rsquo;t call upon my lifelines for help.  Alas, more reboots ahoy.  At least
this time they give me really vague instructions.  This probably would&rsquo;ve
confused me into doing more reboots and searching, but I&rsquo;ve already been here.
Now that I&rsquo;ve blessed this kernel extension from Benjamin (who is that?), I go
back to try it again.  Still blocked.  The System Settings section tells me
there&rsquo;s a kernel extension that needs to be blessed - it doesn&rsquo;t give me
indication that I&rsquo;ve blessed anything already.  Ugh.  Why is this such a
miserable experience?  Again I reboot into recovery mode, bring up the Security
Utility, and bless the kernel extension.  This time it goes away.  I was
operating in the suspicion that there might be more than one kernel extension
involved, and all of them must be blessed individually.
</p>

<p>
Now I try again.  I have some vague memory that mount processes don&rsquo;t typically
create the actual mount point directory in Linux, so I assume it&rsquo;s the same
here.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgc12fae2"><span style="color: #FCCE7B;">sudo</span> <span style="color: #FCCE7B;">mkdir</span> /Volumes/4s2
<span style="color: #FCCE7B;">sudo</span> fuse-ext2 /dev/disk4s2 /Volumes/4s2
</pre>
</div>

<p>
Nothing happens.  The directory is empty and I have exit code 253 from
<code>fuse-ext2</code> (having your prompt show the last exit code is so incredibly
useful).  What&rsquo;s 253 mean?  I check the man page - nothing.  From searching on
other people trying things out, I add a <code>-o debug</code> to the invocation.  No
output, same code. I add <code>-v</code> to the front of the from/to arguments.  No change
in output/code.  I worry this is resulting from my hack earlier to <code>e2fsprogs</code>.
But I would expect to see <span class="underline">something</span> here.  There is mention of a
<code>/var/log/fuse-ext2_util.log</code> in some tickets I see, but I don&rsquo;t have that.
</p>

<p>
I try:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org131e1cc"><span style="color: #FCCE7B;">sudo</span> mount -t fuse-ext2 /dev/disk4s2 /Volumes/4s2
</pre>
</div>

<pre class="example">
mount: exec /Library/Filesystems/fuse-ext2.fs/Contents/Resources/mount_fuse-ext2 for /Volumes/4s2: No such file or directory
mount: /Volumes/4s2 failed with 72
</pre>


<p>
The <code>No such file or directory</code> portion can&rsquo;t be correct on the latter path -
<code>/Volumes/4s2</code> exists.  I check the <code>/Library/Filesystems/...</code> path and it is
indeed non-existent.  Curious, looking in <code>/Library/Filesystems</code> directly shows
me <span class="underline">something</span> of relevance:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgc77de38"><span style="color: #FCCE7B;">ls</span> /Library/Filesystems
</pre>
</div>

<pre class="example">
NetFSPlugins
macfuse.fs
</pre>



<p>
So I try this modified <code>mount</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org0737515"><span style="color: #FCCE7B;">sudo</span> mount -t macfuse.fs /dev/disk4s2 /Volumes/4s2
</pre>
</div>

<pre class="example">
macFUSE mount version 4.5.0

This program is not meant to be called directly. The macFUSE library calls it.

Available mount options:
    -o allow_other         allow access to others besides the user who mounted
                           the file system
    -o allow_recursion     allow a mount point that itself resides on a macFUSE
                           volume (by default, such mounting is disallowed)
    -o allow_root          allow access to root (can't be used with allow_other)
    -o auto_xattr          handle extended attributes entirely through ._ files
    -o blocksize=&lt;size&gt;    specify block size in bytes of "storage"
    -o daemon_timeout=&lt;s&gt;  timeout in seconds for kernel calls to daemon
    -o debug               turn on debug information printing
    -o default_permissions let the kernel handle permission checks locally
    -o defer_permissions   defer permission checks to file operations themselves
    -o direct_io           use alternative (direct) path for kernel-user I/O
    -o extended_security   turn on macOS extended security (ACLs)
    -o fsid=&lt;fsid&gt;         set the second 32-bit component of the fsid
    -o fsname=&lt;name&gt;       set the file system's name
    -o fssubtype=&lt;num&gt;     set the file system's fssubtype identifier
    -o fstypename=&lt;name&gt;   set the file system's type name
    -o iosize=&lt;size&gt;       specify maximum I/O size in bytes
    -o jail_symlinks       contain symbolic links within the mount
    -o local               mark the volume as "local" (default is "nonlocal")
    -o negative_vncache    enable vnode name caching of non-existent objects
    -o sparse              enable support for sparse files
    -o volname=&lt;name&gt;      set the file system's volume name

Available negative mount options:
    -o noalerts            disable all graphical alerts (if any) in macFUSE Core
    -o noappledouble       ignore Apple Double (._) and .DS_Store files entirely
    -o noapplexattr        ignore all "com.apple.*" extended attributes
    -o nobrowse            mark the volume as non-browsable by the Finder
    -o nolocalcaches       meta option equivalent to noreadahead,noubc,novncache
    -o noreadahead         disable I/O read-ahead behavior for this file system
    -o nosynconclose       disable sync-on-close behavior (enabled by default)
    -o nosyncwrites        disable synchronous-writes behavior (dangerous)
    -o noubc               disable the unified buffer cache for this file system
    -o novncache           disable the vnode name cache for this file system
mount: /Volumes/4s2 failed with 64
</pre>


<p>
So <code>mount</code> is looking less promising.  This appears to be <code>mount</code> just spewing
the usage information of <code>macfuse</code> because it is giving <code>macfuse</code> an erroneous
invocation.  Is this intended to ever work?  I found this invocation from other
lost souls who were experiencing no luck here as well, so it might not mean
much.
</p>

<p>
Following some other tickets, I want to just confirm that everything I have is
in order.  Oftentimes errors come from the user, not the software.  I find <code>sudo
diskutil list</code> gives some good answers.
</p>

<pre class="example" id="orgf32fc4d">
&lt;snip&gt;
/dev/disk6 (internal, physical):
   #:                       TYPE NAME                    SIZE       IDENTIFIER
   0:     FDisk_partition_scheme                        *127.9 GB   disk6
   1:                 DOS_FAT_32 FIRMWARE                31.5 MB    disk6s1
   2:                      Linux                         127.8 GB   disk6s2
</pre>

<p>
I have been operating with the notion that I was using <code>disk4</code>, but between
reboots and swapping the physical card out to stow my laptop between attempts,
it must have moved.  Sigh.  Let&rsquo;s do this again.  At least I know with
confidence that I want to be mounting the &ldquo;2&rdquo; partition.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgc869d4e"><span style="color: #FCCE7B;">sudo</span> fuse-ext2 /dev/disk6s2 /Volumes/4s2
</pre>
</div>

<p>
I didn&rsquo;t rename the directory to a matching <code>6s2</code> because I just want to <span class="underline">try</span>
something.  Results are promising and with a delay:
</p>

<pre class="example" id="orgee11389">
Mounting /dev/disk6s2 Read-Only.
Use 'force' or 'rw+' options to enable Read-Write mode
</pre>

<p>
And then:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgbe6c9e1"><span style="color: #FCCE7B;">ls</span> /Volumes/4s2
</pre>
</div>

<p>
Wow something worked!  I&rsquo;m going to treat myself.
</p>

<p>
Now let&rsquo;s clean up the directory name, and make it read+write.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org1f3a286"><span style="color: #FCCE7B;">sudo</span> umount /Volumes/4s2
<span style="color: #FCCE7B;">sudo</span> <span style="color: #FCCE7B;">mv</span> /Volumes/<span style="color: #51afef;">{</span>4,6<span style="color: #51afef;">}</span>s2
<span style="color: #FCCE7B;">sudo</span> fuse-ext2 -o rw+ /dev/disk6s2 /Volumes/4s2
</pre>
</div>

<p>
Actually just trying to scroll through some shell history wound up making the
machine unusable, and it eventually necessitated a reboot.  I&rsquo;ve lost any
home-made directories under <code>/Volume</code> and so I can just make them the way I want
them.  I am a little worried that maybe my hacks I made to <code>g2fsprogs</code> have
introduced some critical instability to my kernel, but I fail to see how the
<code>xattrs</code> stuff would have anything to do with my shell history.  Perhaps it&rsquo;s
due to some <code>zsh</code> magic?
</p>

<p>
The commands again, and note that now we&rsquo;re back to <code>disk4</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org5eb57b6"><span style="color: #FCCE7B;">sudo</span> <span style="color: #FCCE7B;">mkdir</span> /Volumes/picard
<span style="color: #FCCE7B;">sudo</span> fuse-ext2 -o rw+ /dev/disk4s2 /Volumes/picard
</pre>
</div>

<p>
And that worked!  Now to make edits to the card.
</p>
</div>
</div>
