nix-adventures-01.org
** Making Edits to the SD Card
:PROPERTIES:
:CUSTOM_ID: somehow-write-to-the-pi-sd-card--making-edits-to-the-sd-card
:END:

*** =sshd=
:PROPERTIES:
:CUSTOM_ID: somehow-write-to-the-pi-sd-card--making-edits-to-the-sd-card--=sshd=
:END:

I need to "enable" =sshd=, assuming it comes installed.  If it does not come
installed, this will have been a very wasteful effort.

Searching on this topic, I find [[https://www.raspberrypi.com/news/raspberry-pi-bullseye-update-april-2022/][an article]] with this:

#+begin_quote
There are also mechanisms to preconfigure an image without using Imager. To set
up a user on first boot and bypass the wizard completely, create a file called
userconf or userconf.txt in the boot partition of the SD card; this is the part
of the SD card which can be seen when it is mounted in a Windows or MacOS
computer.
#+end_quote

This section doesn't detail how to enable =sshd=, but the original post that
lead me to this article has some additional instructions:

#+begin_quote
The empty 'ssh' (or ssh.txt) file should act as a toggle (turn SSH on, and it
will stay on unless you explicitly disable it later). If that's not how it's
working for you, then something else that was done to the system has messed that
up.
#+end_quote

Right.  So I didn't need to do any of the prior section at all?  Let's look and
be sure.  I happen to recall that the default name of the SD card is =FIRMWARE=
for whatever reason.

Okay, I'm going to try really hard not to swear off computers forever.

#+begin_src shell :results output
touch /Volumes/FIRMWARE/ssh
echo "$USER:$(echo 'lolno' | openssl passwd -stdin)" > /Volumes/FIRMWARE/userconf
#+end_src

The instructions use a =-6= argument, but that doesn't work for my =openssl=:

#+begin_src shell :results output :cache yes :exports both
openssl version
#+end_src

#+RESULTS[fd79c183d922dc546b2e5c0472485a433c65ca97]:
: LibreSSL 3.3.6

Which I believe is the stock version running on my MacBook, based on:

#+begin_src shell :results output :cache yes :exports both
which openssl
#+end_src

#+RESULTS[dd1abf4838ce8ea7276cd82f3e78e268f7cec79e]:
: /usr/bin/openssl

Otherwise it would be a deep path under =/nix=.

A quick check of the files shows they are there and in the desired state:

#+begin_src shell :results output :exports both :cache yes
ls /Volumes/FIRMWARE/ssh
cat /Volumes/FIRMWARE/userconf
#+end_src

#+RESULTS[745fc503a9afa80c6d3f6fb251a8e1c43610236f]:
: /Volumes/FIRMWARE/ssh
: logan:oKYG/fePTExgs

I have no worries about the password here - it will be changed before this
device connects to anything outside of my laptop.

Okay let's give it a go.  I eject the mounts (=picard= needs a =sudo umount
/Volumes/picard= but works without a hitch).

An import caveat: I found from [[https://gijs-de-jong.nl/posts/how-raspberry-pi-enbales-ssh-when-boot-ssh-file-is-present/][How the Raspberry Pi enables SSH when
/boot/ssh.txt is present]] that these files are removed on boot - so we only get
one shot, and if it fails we have to run it again.  This is one of the benefits
of blogging as I do this - the command history is at my fingertips.

The files are listed the [[https://www.raspberrypi.com/documentation/computers/configuration.html#the-boot-folder][configuration boot section documentation]].

** Connecting to the Pi (USB-C fail)
:PROPERTIES:
:CUSTOM_ID: somehow-write-to-the-pi-sd-card--connecting-to-the-pi-usb-c-fail
:END:

I did forget about networking, which isn't covered in the boot section linked
above.  I had worked on this earlier but the =169.254.0.0/16= address space is
way too large to =nmap= over.  Instead I read in the boot section there's an
"OTG" (On The Go) USB setting that is enabled by default in =config.txt= (at
least in my case, being it's a Pi 4B).  I don't want to just plug it in and find
out, and I actually did try =raspberrypi.local= earlier, I thought, and that
didn't work.  I found a =ping= in my history to it in fact, so I know this was
attempted and failed.  There may be something else involved.  This [[https://raspberrypi.stackexchange.com/a/100727][answer]]
specifically talks about macOS and OTG.  It does mention to use Bonjour to find
the Pi, which apparently it advertises on.

The command link invocation is provided in this [[https://apple.stackexchange.com/a/362741][answer]]:

#+begin_src shell :results output :exports code
dns-sd -Gv4v6 raspberrypi.local
#+end_src

That doesn't work.  I do recall some chatter in the OTG+MacBook answer that
talked about some problems with OTG and certain cables.  It links to an article
about an [[https://hackaday.com/2019/07/16/exploring-the-raspberry-pi-4-usb-c-issue-in-depth/][issue with USB-C on the Pi]] that is probably causing me problems.
Essentially it means that the Pi isn't powered properly if the USB-C cable is
"e-marked" (meaning it can identify/query additional features).

So how do I know if the Pi got sufficient power or not?  I can check the SD card
to see if the configuration files were removed on-boot.

#+begin_src shell :results output :exports both :cache yes
ls /Volumes/FIRMWARE | grep ssh
ls /Volumes/FIRMWARE | grep userconf
#+end_src

#+RESULTS[b9b1f6084d57e738ed509800291ecaff1db68bca]:
: ssh
: userconf

Sure enough, they are both present.  So the Pi didn't boot properly.  I did have
a solid red light, with an occasionally blinking green light.  I don't know what
that means yet, but perhaps I should learn.  I have read it is programmable and
may have changed over time, so I don't want to go too far down that path.  In
any case, we didn't make it.  For what it's worth, the Pi was connected for a
solid 5-10 minutes.

I only glanced at the USB-C diagrams in the article linked prior.  I also
skimmed through parts of the article itself.  I would need a specifically bad
USB-C cable - it would need to transmit data but not be "e-marked".  I suspect
that would be hard to find.

I did learn somewhat recently that USB cables (even USB-C) sometimes are
hard-wired to actually be a true "charging cable" in that all they do is provide
power, and all of the data pins are grounded or shared.  That's not part of the
spec, and it explains why a lot of people get cables that "work" but sometimes
don't (via reviews or one's own personal experience).  It's a real shame we
don't have standard, human-readable markings for these differences.  This [[https://www.youtube.com/watch?v=AD5aAd8Oy84][video]]
was really enlightening on the topic, and also shows off some fascinating
circuitry in the thunderbolt cables which share the USB-C form factor.

So I need to plug this in via a battery or wall outlet, and I need to run an
Ethernet cable between the Pi and my laptop.  I do have the equipment on hand
for all of this.

