nix-adventures-01.html
<div id="outline-container-somehow-write-to-the-pi-sd-card--making-edits-to-the-sd-card" class="outline-3">
<h3 id="somehow-write-to-the-pi-sd-card--making-edits-to-the-sd-card"><span class="section-number-3">5.2.</span> Making Edits to the SD Card</h3>
<div class="outline-text-3" id="text-somehow-write-to-the-pi-sd-card--making-edits-to-the-sd-card">
</div>
<div id="outline-container-somehow-write-to-the-pi-sd-card--making-edits-to-the-sd-card--=sshd=" class="outline-4">
<h4 id="somehow-write-to-the-pi-sd-card--making-edits-to-the-sd-card--=sshd="><span class="section-number-4">5.2.1.</span> <code>sshd</code></h4>
<div class="outline-text-4" id="text-somehow-write-to-the-pi-sd-card--making-edits-to-the-sd-card--=sshd=">
<p>
I need to &ldquo;enable&rdquo; <code>sshd</code>, assuming it comes installed.  If it does not come
installed, this will have been a very wasteful effort.
</p>

<p>
Searching on this topic, I find <a href="https://www.raspberrypi.com/news/raspberry-pi-bullseye-update-april-2022/">an article</a> with this:
</p>

<blockquote>
<p>
There are also mechanisms to preconfigure an image without using Imager. To set
up a user on first boot and bypass the wizard completely, create a file called
userconf or userconf.txt in the boot partition of the SD card; this is the part
of the SD card which can be seen when it is mounted in a Windows or MacOS
computer.
</p>
</blockquote>

<p>
This section doesn&rsquo;t detail how to enable <code>sshd</code>, but the original post that
lead me to this article has some additional instructions:
</p>

<blockquote>
<p>
The empty &rsquo;ssh&rsquo; (or ssh.txt) file should act as a toggle (turn SSH on, and it
will stay on unless you explicitly disable it later). If that&rsquo;s not how it&rsquo;s
working for you, then something else that was done to the system has messed that
up.
</p>
</blockquote>

<p>
Right.  So I didn&rsquo;t need to do any of the prior section at all?  Let&rsquo;s look and
be sure.  I happen to recall that the default name of the SD card is <code>FIRMWARE</code>
for whatever reason.
</p>

<p>
Okay, I&rsquo;m going to try really hard not to swear off computers forever.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgb3e046d"><span style="color: #FCCE7B;">touch</span> /Volumes/FIRMWARE/ssh
<span style="color: #FCCE7B;">echo</span> <span style="color: #7bc275;">"</span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">USER</span><span style="color: #7bc275;">:</span><span style="color: #C57BDB; font-weight: bold;">$(</span><span style="color: #C57BDB; font-weight: bold;">echo</span><span style="color: #C57BDB; font-weight: bold;"> 'lolno' | openssl passwd -stdin)</span><span style="color: #7bc275;">"</span> &gt; /Volumes/FIRMWARE/usercon<span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">f</span>
</pre>
</div>

<p>
The instructions use a <code>-6</code> argument, but that doesn&rsquo;t work for my <code>openssl</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orga8a2c07">openssl version
</pre>
</div>

<pre class="example">
LibreSSL 3.3.6
</pre>


<p>
Which I believe is the stock version running on my MacBook, based on:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org716fa20"><span style="color: #C57BDB;">which</span> openssl
</pre>
</div>

<pre class="example">
/usr/bin/openssl
</pre>


<p>
Otherwise it would be a deep path under <code>/nix</code>.
</p>

<p>
A quick check of the files shows they are there and in the desired state:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org288a97a"><span style="color: #FCCE7B;">ls</span> /Volumes/FIRMWARE/ssh
<span style="color: #FCCE7B;">cat</span> /Volumes/FIRMWARE/userconf
</pre>
</div>

<pre class="example">
/Volumes/FIRMWARE/ssh
logan:oKYG/fePTExgs
</pre>


<p>
I have no worries about the password here - it will be changed before this
device connects to anything outside of my laptop.
</p>

<p>
Okay let&rsquo;s give it a go.  I eject the mounts (<code>picard</code> needs a <code>sudo umount
/Volumes/picard</code> but works without a hitch).
</p>

<p>
An import caveat: I found from <a href="https://gijs-de-jong.nl/posts/how-raspberry-pi-enbales-ssh-when-boot-ssh-file-is-present/">How the Raspberry Pi enables SSH when
/boot/ssh.txt is present</a> that these files are removed on boot - so we only get
one shot, and if it fails we have to run it again.  This is one of the benefits
of blogging as I do this - the command history is at my fingertips.
</p>

<p>
The files are listed the <a href="https://www.raspberrypi.com/documentation/computers/configuration.html#the-boot-folder">configuration boot section documentation</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-somehow-write-to-the-pi-sd-card--connecting-to-the-pi-usb-c-fail" class="outline-3">
<h3 id="somehow-write-to-the-pi-sd-card--connecting-to-the-pi-usb-c-fail"><span class="section-number-3">5.3.</span> Connecting to the Pi (USB-C fail)</h3>
<div class="outline-text-3" id="text-somehow-write-to-the-pi-sd-card--connecting-to-the-pi-usb-c-fail">
<p>
I did forget about networking, which isn&rsquo;t covered in the boot section linked
above.  I had worked on this earlier but the <code>169.254.0.0/16</code> address space is
way too large to <code>nmap</code> over.  Instead I read in the boot section there&rsquo;s an
&ldquo;OTG&rdquo; (On The Go) USB setting that is enabled by default in <code>config.txt</code> (at
least in my case, being it&rsquo;s a Pi 4B).  I don&rsquo;t want to just plug it in and find
out, and I actually did try <code>raspberrypi.local</code> earlier, I thought, and that
didn&rsquo;t work.  I found a <code>ping</code> in my history to it in fact, so I know this was
attempted and failed.  There may be something else involved.  This <a href="https://raspberrypi.stackexchange.com/a/100727">answer</a>
specifically talks about macOS and OTG.  It does mention to use Bonjour to find
the Pi, which apparently it advertises on.
</p>

<p>
The command link invocation is provided in this <a href="https://apple.stackexchange.com/a/362741">answer</a>:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orge23ebff">dns-sd -Gv4v6 raspberrypi.local
</pre>
</div>

<p>
That doesn&rsquo;t work.  I do recall some chatter in the OTG+MacBook answer that
talked about some problems with OTG and certain cables.  It links to an article
about an <a href="https://hackaday.com/2019/07/16/exploring-the-raspberry-pi-4-usb-c-issue-in-depth/">issue with USB-C on the Pi</a> that is probably causing me problems.
Essentially it means that the Pi isn&rsquo;t powered properly if the USB-C cable is
&ldquo;e-marked&rdquo; (meaning it can identify/query additional features).
</p>

<p>
So how do I know if the Pi got sufficient power or not?  I can check the SD card
to see if the configuration files were removed on-boot.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgd12bba0"><span style="color: #FCCE7B;">ls</span> /Volumes/FIRMWARE | <span style="color: #FCCE7B;">grep</span> ssh
<span style="color: #FCCE7B;">ls</span> /Volumes/FIRMWARE | <span style="color: #FCCE7B;">grep</span> userconf
</pre>
</div>

<pre class="example">
ssh
userconf
</pre>


<p>
Sure enough, they are both present.  So the Pi didn&rsquo;t boot properly.  I did have
a solid red light, with an occasionally blinking green light.  I don&rsquo;t know what
that means yet, but perhaps I should learn.  I have read it is programmable and
may have changed over time, so I don&rsquo;t want to go too far down that path.  In
any case, we didn&rsquo;t make it.  For what it&rsquo;s worth, the Pi was connected for a
solid 5-10 minutes.
</p>

<p>
I only glanced at the USB-C diagrams in the article linked prior.  I also
skimmed through parts of the article itself.  I would need a specifically bad
USB-C cable - it would need to transmit data but not be &ldquo;e-marked&rdquo;.  I suspect
that would be hard to find.
</p>

<p>
I did learn somewhat recently that USB cables (even USB-C) sometimes are
hard-wired to actually be a true &ldquo;charging cable&rdquo; in that all they do is provide
power, and all of the data pins are grounded or shared.  That&rsquo;s not part of the
spec, and it explains why a lot of people get cables that &ldquo;work&rdquo; but sometimes
don&rsquo;t (via reviews or one&rsquo;s own personal experience).  It&rsquo;s a real shame we
don&rsquo;t have standard, human-readable markings for these differences.  This <a href="https://www.youtube.com/watch?v=AD5aAd8Oy84">video</a>
was really enlightening on the topic, and also shows off some fascinating
circuitry in the thunderbolt cables which share the USB-C form factor.
</p>

<p>
So I need to plug this in via a battery or wall outlet, and I need to run an
Ethernet cable between the Pi and my laptop.  I do have the equipment on hand
for all of this.
</p>
</div>
</div>
