nix-adventures-01.org
** Imaging the Pi Correctly
:PROPERTIES:
:CUSTOM_ID: somehow-write-to-the-pi-sd-card--imaging-the-pi-correctly
:END:

I have blinking Ethernet lights.  The Pi has a solid red light, and the green
light is doing a dot-dot kind of pattern, repeatedly.

I've done a little looking into for the light patterns. The Pi 4B uses a new
set of patterns.  However my 2 pattern (two of anything but nothing else)
doesn't show up on the list.  Checking my command history from earlier, I can
see that I'm using a NixOS image.  Perhaps that is related.  I got that from
this [[https://nix.dev/tutorials/nixos/installing-nixos-on-a-raspberry-pi.html][instruction]] available on the official NixOS documentation.  It does assume
a 4B model, but might be demanding more RAM than what I gave the Pi.  My
purchase order for the Pi shows it as 2 GB, but the documentation says it should
be 4GB.  I don't know how hard that limitation is.  Also, and perhaps most
critically, this cannot work because it doesn't use the Pi's normal
configuration.  Okay now I think we're onto something.  I did want to do this
via NixOS but I think I might be best off saving that for another day.  This
post has gotten enormous from all of the research and attempts already.  I've
also noticed the documentation tails behind the current NixOS image version.
Ugh.  I just need to do this myself - later.

* Abandon Nix and Just Get it Done :private:
:PROPERTIES:
:CUSTOM_ID: abandon-nix-and-just-get-it-done
:END:

As much as I wanted this to be something about Nix, it turned into a series of
other hardships.  NixOS introduced other, undocumented complications to the
process.  I still lack the ability to manage the Pi's packages, let alone via
the "Nix way".

I used:

#+begin_src shell :results none :exports code
wget https://downloads.raspberrypi.com/raspios_arm64/images/raspios_arm64-2023-12-06/2023-12-05-raspios-bookworm-arm64.img.xz\?_gl\=1\*qvoa7r\*_ga\*MjYzMjA4NTA3LjE3MDMyMzk1Nzc.\*_ga_22FD70LWDS\*MTcwMzMzMTYzMi4yLjAuMTcwMzMzMTYzMi4wLjAuMA..
mv \
  '2023-12-05-raspios-bookworm-arm64.img.xz?_gl=1*qvoa7r*_ga*MjYzMjA4NTA3LjE3MDMyMzk1Nzc.*_ga_22FD70LWDS*MTcwMzMzMTYzMi4yLjAuMTcwMzMzMTYzMi4wLjAuMA..' \
  2023-12-05-raspios-bookworm-arm64.img.xz
unxz 2023-12-05-raspios-bookworm-arm64.img.xz
#+end_src

Oh oh, I did get to use Nix a little!  I had to install the =xz= package to get
=unxz=.

And then flashed the card with:

#+begin_src shell :results none :exports code
sudo dd if=2023-12-05-raspios-bookworm-arm64.img of=/dev/disk4 bs=1M status=progress conv=fsync
#+end_src
* Building the Image
:PROPERTIES:
:CUSTOM_ID: building-the-image
:END:

Okay, let's build our own NixOS image for the Pi.

** Prior Art
:PROPERTIES:
:CUSTOM_ID: building-the-image--prior-art
:END:

I came across [[https://discourse.nixos.org/t/headless-raspberry-pi-setup/17664/7][Headless Raspberry Pi on NixOS Discourse]] and user Sweenu states
they have a working version of NixOS being deployed to a Raspberry Pi.  The
source is all posted to [[https://github.com/sweenu/nixfiles]].  From some brief
research, it does use a tool called [[https://github.com/divnix/digga][digga]] that states that it is no longer
recommended for use, which is expanded upon in [[https://github.com/divnix/digga/issues/503][issue#503]] for the repository.  In
essence, =digga= seems to have some customization / scaling difficulties because
it focused on ergonomics first.  There isn't any real alternatives recommended
that are purpose built for what =digga= does (which, to be honest, I'm not
entirely sure _what_ it does).  I'd prefer to keep my research to shiny new
things to a minimum, so I hope I can adlib what should be already working for
someone else, but to fit my needs.  Primarily I want image generation that gives
me a working NixOS based Raspberry Pi image, but also have it configured in such
a way that I don't have to re-flash the SD card every time I want to make a
change.  In other words, I want to be able to build an image but also be able to
manage the host configuration via a standard Nix configuration.

In the Discourse, Sweenu states the Pi can be updated thusly:

#+begin_src shell :results none :exports code
nix flake update
deploy ".#grunfeld"
#+end_src

Where =grunfeld= is the name of the Raspberry Pi.

In the repository's README, it states the image can be created and copied like
so:

#+begin_src shell :results none :exports code
nixos-generate --flake '.#grunfeld' --format sd-aarch64 --system aarch64-linux
unzstd -d {the output path from the command above} -o nixos-sd-image.img
sudo dd if=nixos-sd-image.img of=/dev/sda bs=64K status=progress
#+end_src

This is all very promising.  I've done some copying/adlibing of the repository
in my =proton-nix= repository, which I plan on using to declare my local network
configuration.  I do have some security concerns about open sourcing it,
especially because both public and private keys seem to be present in the
repository (even if the private keys are encrypted at rest).  I would like a way
to share this, without the private bits hanging out for all to see.  This has
been something I've looked into before with Nix and =nix-flakes= in particular
because =flakes= really wants everything to be self contained, lest it be marked
as "impure".  From reading Ian's blog I mentioned earlier, it does seem like one
can reference a file using a git repository link.  If =flakes= is happy with
this, then I think I could be very happy with it as well.

But first, we need a detour.  I don't have a means of actually using =NixOS=
because I'm on macOS.  As I understand, this does require work with a container
or VM.

