nix-adventures-01.html
<div id="outline-container-somehow-write-to-the-pi-sd-card--imaging-the-pi-correctly" class="outline-3">
<h3 id="somehow-write-to-the-pi-sd-card--imaging-the-pi-correctly"><span class="section-number-3">5.4.</span> Imaging the Pi Correctly</h3>
<div class="outline-text-3" id="text-somehow-write-to-the-pi-sd-card--imaging-the-pi-correctly">
<p>
I have blinking Ethernet lights.  The Pi has a solid red light, and the green
light is doing a dot-dot kind of pattern, repeatedly.
</p>

<p>
I&rsquo;ve done a little looking into for the light patterns. The Pi 4B uses a new
set of patterns.  However my 2 pattern (two of anything but nothing else)
doesn&rsquo;t show up on the list.  Checking my command history from earlier, I can
see that I&rsquo;m using a NixOS image.  Perhaps that is related.  I got that from
this <a href="https://nix.dev/tutorials/nixos/installing-nixos-on-a-raspberry-pi.html">instruction</a> available on the official NixOS documentation.  It does assume
a 4B model, but might be demanding more RAM than what I gave the Pi.  My
purchase order for the Pi shows it as 2 GB, but the documentation says it should
be 4GB.  I don&rsquo;t know how hard that limitation is.  Also, and perhaps most
critically, this cannot work because it doesn&rsquo;t use the Pi&rsquo;s normal
configuration.  Okay now I think we&rsquo;re onto something.  I did want to do this
via NixOS but I think I might be best off saving that for another day.  This
post has gotten enormous from all of the research and attempts already.  I&rsquo;ve
also noticed the documentation tails behind the current NixOS image version.
Ugh.  I just need to do this myself - later.
</p>
</div>
</div>
</div>
<div id="outline-container-abandon-nix-and-just-get-it-done" class="outline-2">
<h2 id="abandon-nix-and-just-get-it-done"><span class="section-number-2">6.</span> Abandon Nix and Just Get it Done<span class="tag"><span class="private">private</span></span></h2>
<div class="outline-text-2" id="text-abandon-nix-and-just-get-it-done">
<p>
As much as I wanted this to be something about Nix, it turned into a series of
other hardships.  NixOS introduced other, undocumented complications to the
process.  I still lack the ability to manage the Pi&rsquo;s packages, let alone via
the &ldquo;Nix way&rdquo;.
</p>

<p>
I used:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org9776a29">wget https://downloads.raspberrypi.com/raspios_arm64/images/raspios_arm64-2023-1<span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">2-06/2023-12-05-raspios-bookworm-arm64.img.xz</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">\?</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">_gl</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">\=</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">1</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">\*</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">qvoa7r</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">\*</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">_ga</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">\*</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">MjYzMjA4NTA3LjE3MDMyMzk1Nzc.</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">\*</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">_ga_22FD70LWDS</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">\*</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">MTcwMzMzMTYzMi4yLjAuMTcwMzMzMTYzMi4wLjAuMA..</span>
<span style="color: #FCCE7B;">mv</span> <span style="color: #7bc275;">\</span>
  <span style="color: #7bc275;">'2023-12-05-raspios-bookworm-arm64.img.xz?_gl=1*qvoa7r*_ga*MjYzMjA4NTA3LjE3MDM</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">yMzk1Nzc.*_ga_22FD70LWDS*MTcwMzMzMTYzMi4yLjAuMTcwMzMzMTYzMi4wLjAuMA..'</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;"> </span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">\</span>
  2023-12-05-raspios-bookworm-arm64.img.xz
unxz 2023-12-05-raspios-bookworm-arm64.img.xz
</pre>
</div>

<p>
Oh oh, I did get to use Nix a little!  I had to install the <code>xz</code> package to get
<code>unxz</code>.
</p>

<p>
And then flashed the card with:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org9b71add"><span style="color: #FCCE7B;">sudo</span> dd <span style="color: #dcafe9;">if</span>=2023-12-05-raspios-bookworm-arm64.img <span style="color: #dcafe9;">of</span>=/dev/disk4 <span style="color: #dcafe9;">bs</span>=1M <span style="color: #dcafe9;">status</span>=prog<span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">ress </span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">conv</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">=fsync</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-building-the-image" class="outline-2">
<h2 id="building-the-image"><span class="section-number-2">7.</span> Building the Image</h2>
<div class="outline-text-2" id="text-building-the-image">
<p>
Okay, let&rsquo;s build our own NixOS image for the Pi.
</p>
</div>
<div id="outline-container-building-the-image--prior-art" class="outline-3">
<h3 id="building-the-image--prior-art"><span class="section-number-3">7.1.</span> Prior Art</h3>
<div class="outline-text-3" id="text-building-the-image--prior-art">
<p>
I came across <a href="https://discourse.nixos.org/t/headless-raspberry-pi-setup/17664/7">Headless Raspberry Pi on NixOS Discourse</a> and user Sweenu states
they have a working version of NixOS being deployed to a Raspberry Pi.  The
source is all posted to <a href="https://github.com/sweenu/nixfiles">https://github.com/sweenu/nixfiles</a>.  From some brief
research, it does use a tool called <a href="https://github.com/divnix/digga">digga</a> that states that it is no longer
recommended for use, which is expanded upon in <a href="https://github.com/divnix/digga/issues/503">issue#503</a> for the repository.  In
essence, <code>digga</code> seems to have some customization / scaling difficulties because
it focused on ergonomics first.  There isn&rsquo;t any real alternatives recommended
that are purpose built for what <code>digga</code> does (which, to be honest, I&rsquo;m not
entirely sure <span class="underline">what</span> it does).  I&rsquo;d prefer to keep my research to shiny new
things to a minimum, so I hope I can adlib what should be already working for
someone else, but to fit my needs.  Primarily I want image generation that gives
me a working NixOS based Raspberry Pi image, but also have it configured in such
a way that I don&rsquo;t have to re-flash the SD card every time I want to make a
change.  In other words, I want to be able to build an image but also be able to
manage the host configuration via a standard Nix configuration.
</p>

<p>
In the Discourse, Sweenu states the Pi can be updated thusly:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orga5596fc">nix flake update
deploy <span style="color: #7bc275;">".#grunfeld"</span>
</pre>
</div>

<p>
Where <code>grunfeld</code> is the name of the Raspberry Pi.
</p>

<p>
In the repository&rsquo;s README, it states the image can be created and copied like
so:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgc1a771a">nixos-generate --flake <span style="color: #7bc275;">'.#grunfeld'</span> --format sd-aarch64 --system aarch64-linux
unzstd -d <span style="color: #51afef;">{</span>the output path from the command above<span style="color: #51afef;">}</span> -o nixos-sd-image.img
<span style="color: #FCCE7B;">sudo</span> dd <span style="color: #dcafe9;">if</span>=nixos-sd-image.img <span style="color: #dcafe9;">of</span>=/dev/sda <span style="color: #dcafe9;">bs</span>=64K <span style="color: #dcafe9;">status</span>=progress
</pre>
</div>

<p>
This is all very promising.  I&rsquo;ve done some copying/adlibing of the repository
in my <code>proton-nix</code> repository, which I plan on using to declare my local network
configuration.  I do have some security concerns about open sourcing it,
especially because both public and private keys seem to be present in the
repository (even if the private keys are encrypted at rest).  I would like a way
to share this, without the private bits hanging out for all to see.  This has
been something I&rsquo;ve looked into before with Nix and <code>nix-flakes</code> in particular
because <code>flakes</code> really wants everything to be self contained, lest it be marked
as &ldquo;impure&rdquo;.  From reading Ian&rsquo;s blog I mentioned earlier, it does seem like one
can reference a file using a git repository link.  If <code>flakes</code> is happy with
this, then I think I could be very happy with it as well.
</p>

<p>
But first, we need a detour.  I don&rsquo;t have a means of actually using <code>NixOS</code>
because I&rsquo;m on macOS.  As I understand, this does require work with a container
or VM.
</p>
</div>
</div>
