nix-adventures-01.org
** Doing Real Nix Things on macOS
:PROPERTIES:
:CUSTOM_ID: building-the-image--doing-real-nix-things-on-macos
:END:

On this current MacBook, I've successfully avoided running Docker.  I've come to
liken Docker to bloatware (whether that's fair or not).  On my home network,
I've had a degree of success with Podman.  However there's hitches with it, as
there always is.  I also have a very small amount of space available on my
MacBook, and =containerd= containers aren't known for their small size - unless
they use Alpine, I guess.  Either way it will need an entire VM to work -
because macOS doesn't have cgroups et. al.  There appears to be some promising
work done to [[https://earthly.dev/blog/macos-native-containers/][make containers work on macOS]] but it's way too immature (as of
[2023-12-24 Sun]) for the kind of work we're doing here.

My detour needs an additional detour: I have to clean up some space.  I
presently have < 30GB free and I would love to be running with closer to 100GB
to feel like I can quickly iterate on things without constantly needing to do a
=nix gc= or =docker system prune --force=, and also thereby increasing my build
iteration times significantly (those caches are present for good reason).

Begin space cleaning montage!

Alright I've deleted a bunch of things I had no business keeping, and things I
probably won't remember that I deleted later.  [[https://dev.yorhel.nl/ncdu][ncdu]] was instrumental there!

In a vacuum I'd prefer =podman= to avoid my perceived bloatware of Docker
proper.  I don't recall any current perils, and there does appear to be some
support for running =podman= on =aarch64-darwin= (my specific setup), so let's
give it a shot.

I did find [[https://github.com/NixOS/nixpkgs/issues/169118][nixpkgs#169118]] which outlines some issues with =podman= on macOS, but
they seem to be resolved and nobody feels confident enough to declare it done.
This [[https://github.com/skogsbrus/os/commit/2b10be2d1a48727470a72f9e7b1f307d327adee3][commit]] that refers to the ticket just installs =qemu= and =podman= together
(but with no direct relationship - I don't know how that's supposed to work).
=qemu= is a significant part of working with the VM, I've gathered.

I found [[https://notes.abhinavsarkar.net/2022/just-nix-podman-combo][Just, Nix Shell And Podman Are A Killer Combo]] and learned that Just is a
thing.  The post has some great incantations in it that I was happy to leverage
into this =with-podman.sh= script:

#+begin_src shell :results none :exports code
#!/usr/bin/env bash
set -euo pipefail
container_name="nix-run"
script="$@"

podman machine init --cpus 12 --memory 8192 --disk-size 50 \
      --volume $HOME:$HOME || true
podman machine start || true
podman container ls -a | grep $container_name > /dev/null || \
        podman create -t --name $container_name -w /workdir \
            -v $PWD:/workdir nixos/nix
container_id=$(podman start $container_name)
echo "$container_id"
podman exec $container_id $script
podman stop $container_name || true
podman machine stop
#+end_src

Which basically sets up the Podman VM, starts the container =nixos/nix=
container (named =nix-run=), executes the script (whatever I pass in for args),
and then cleans it all up.  It's very expensive but it's also something I can
use thoughtlessly and I really like that.

Here's an example run:

#+begin_example
@ ./with-podman.sh ls -al
Error: podman-machine-default: VM already exists
Error: cannot start VM podman-machine-default: VM already running or starting
a34354199be6cca047309f9d29ecefeeb1c4521d776536cc6305bad8380874b6
nix-run
total 12
drwxr-xr-x 11 root nobody  352 Dec 24 13:17 .
dr-xr-xr-x  1 root root     77 Dec 24 13:26 ..
drwxr-xr-x 10 root nobody  320 Dec 24 13:23 .git
-rw-r--r--  1 root nobody  283 Dec 22 00:50 README.org
-rw-r--r--  1 root nobody 3809 Dec 24 00:29 flake.nix
drwxr-xr-x  3 root nobody   96 Dec 24 00:30 hosts
drwxr-xr-x  4 root nobody  128 Dec 24 00:40 modules
drwxr-xr-x  3 root nobody   96 Dec 24 00:42 pkgs
drwxr-xr-x  3 root nobody   96 Dec 24 00:52 profiles
drwxr-xr-x  4 root nobody  128 Dec 24 00:41 shell
-rwxr-xr-x  1 root nobody  529 Dec 24 13:26 with-podman.sh
nix-run
Waiting for VM to exit...
Machine "podman-machine-default" stopped successfully

~/dev/proton-nix logan@scandium 0 [22:27:20] 75s
$
#+end_example

Note it took 75 seconds to run on my system just to do =ls= but it works without
me doing anything fancy, I'm running =NixOS=, and the repository I'm working in
is properly volume mounted.  I'm not really worried about speed here, especially
because these invocations I'm about to do will generate disk images - an already
lengthy affair I expect to take on the order of minutes.  Perhaps I will find
short cuts to speed up iteration as I experience pain with building the image
improperly, but I want to reserve my grease until the wheels begin to squeak.

A couple of asides:

1. I looked at =Just= since this is my first exposure to it.  From some quick
   reading around, it seems to be a marginally better =make=.  =make= is
   portable, standard, and yes it has aged but I believe it has aged moderately
   well.  I would not drop portability and familiarity (due to it being fairly
   standard) just for a marginal improvement.  Plus, if the file starts to get
   too squirrelly, I'd rather just break out the complex bits into standalone
   scripts.  If I really could wave a wand and have anything I wanted in terms
   of love to =make=, it would be to give me something like =rake -T= where I
   can simply print all of the tasks available to me.  Reading the code is _not_
   documentation, even if it is a =Makefile=.
2. I tend to go down the rabbit hole on a lot of these ventures, but I'm not
   posting all of it as I go.  Indeed, I just closed a tab pointing to
   =r/programminganimememes=, which was serving as nothing other than pure
   distraction.  I'd followed link to it from the same article linked above.

Now that I have a real Nix system available to me, I need to try to run my
paired down repository from =sweenu= and see if I can build an image from it.

** Building the NixOS Pi image
:PROPERTIES:
:CUSTOM_ID: building-the-image--building-the-nixos-pi-image
:END:

