nix-adventures-01.html
<div id="outline-container-building-the-image--doing-real-nix-things-on-macos" class="outline-3">
<h3 id="building-the-image--doing-real-nix-things-on-macos"><span class="section-number-3">7.2.</span> Doing Real Nix Things on macOS</h3>
<div class="outline-text-3" id="text-building-the-image--doing-real-nix-things-on-macos">
<p>
On this current MacBook, I&rsquo;ve successfully avoided running Docker.  I&rsquo;ve come to
liken Docker to bloatware (whether that&rsquo;s fair or not).  On my home network,
I&rsquo;ve had a degree of success with Podman.  However there&rsquo;s hitches with it, as
there always is.  I also have a very small amount of space available on my
MacBook, and <code>containerd</code> containers aren&rsquo;t known for their small size - unless
they use Alpine, I guess.  Either way it will need an entire VM to work -
because macOS doesn&rsquo;t have cgroups et. al.  There appears to be some promising
work done to <a href="https://earthly.dev/blog/macos-native-containers/">make containers work on macOS</a> but it&rsquo;s way too immature (as of
<span class="timestamp-wrapper"><span class="timestamp">[2023-12-24 Sun]</span></span>) for the kind of work we&rsquo;re doing here.
</p>

<p>
My detour needs an additional detour: I have to clean up some space.  I
presently have &lt; 30GB free and I would love to be running with closer to 100GB
to feel like I can quickly iterate on things without constantly needing to do a
<code>nix gc</code> or <code>docker system prune --force</code>, and also thereby increasing my build
iteration times significantly (those caches are present for good reason).
</p>

<p>
Begin space cleaning montage!
</p>

<p>
Alright I&rsquo;ve deleted a bunch of things I had no business keeping, and things I
probably won&rsquo;t remember that I deleted later.  <a href="https://dev.yorhel.nl/ncdu">ncdu</a> was instrumental there!
</p>

<p>
In a vacuum I&rsquo;d prefer <code>podman</code> to avoid my perceived bloatware of Docker
proper.  I don&rsquo;t recall any current perils, and there does appear to be some
support for running <code>podman</code> on <code>aarch64-darwin</code> (my specific setup), so let&rsquo;s
give it a shot.
</p>

<p>
I did find <a href="https://github.com/NixOS/nixpkgs/issues/169118">nixpkgs#169118</a> which outlines some issues with <code>podman</code> on macOS, but
they seem to be resolved and nobody feels confident enough to declare it done.
This <a href="https://github.com/skogsbrus/os/commit/2b10be2d1a48727470a72f9e7b1f307d327adee3">commit</a> that refers to the ticket just installs <code>qemu</code> and <code>podman</code> together
(but with no direct relationship - I don&rsquo;t know how that&rsquo;s supposed to work).
<code>qemu</code> is a significant part of working with the VM, I&rsquo;ve gathered.
</p>

<p>
I found <a href="https://notes.abhinavsarkar.net/2022/just-nix-podman-combo">Just, Nix Shell And Podman Are A Killer Combo</a> and learned that Just is a
thing.  The post has some great incantations in it that I was happy to leverage
into this <code>with-podman.sh</code> script:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgb9a1ebb"><span style="color: #62686E;">#</span><span style="color: #62686E;">!/usr/bin/</span><span style="color: #51afef;">env</span><span style="color: #62686E;"> bash</span>
<span style="color: #C57BDB;">set</span> -euo pipefail
<span style="color: #dcafe9;">container_name</span>=<span style="color: #7bc275;">"nix-run"</span>
<span style="color: #dcafe9;">script</span>=<span style="color: #7bc275;">"</span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">@</span><span style="color: #7bc275;">"</span>

podman machine init --cpus <span style="color: #e69055; font-weight: bold;">12</span> --memory <span style="color: #e69055; font-weight: bold;">8192</span> --disk-size <span style="color: #e69055; font-weight: bold;">50</span> <span style="color: #7bc275;">\</span>
      --volume $<span style="color: #dcafe9;">HOME</span>:$<span style="color: #dcafe9;">HOME</span> || <span style="color: #C57BDB;">true</span>
podman machine start || <span style="color: #C57BDB;">true</span>
podman container <span style="color: #FCCE7B;">ls</span> -a | <span style="color: #FCCE7B;">grep</span> $<span style="color: #dcafe9;">container_name</span> &gt; /dev/null || <span style="color: #7bc275;">\</span>
        podman create -t --name $<span style="color: #dcafe9;">container_name</span> -w /workdir <span style="color: #7bc275;">\</span>
            -v $<span style="color: #dcafe9;">PWD</span>:/workdir nixos/nix
<span style="color: #dcafe9;">container_id</span>=$<span style="color: #51afef;">(</span>podman start $<span style="color: #dcafe9;">container_name</span><span style="color: #51afef;">)</span>
<span style="color: #FCCE7B;">echo</span> <span style="color: #7bc275;">"</span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">container_id</span><span style="color: #7bc275;">"</span>
podman exec $<span style="color: #dcafe9;">container_id</span> $<span style="color: #dcafe9;">script</span>
podman stop $<span style="color: #dcafe9;">container_name</span> || <span style="color: #C57BDB;">true</span>
podman machine stop
</pre>
</div>

<p>
Which basically sets up the Podman VM, starts the container <code>nixos/nix</code>
container (named <code>nix-run</code>), executes the script (whatever I pass in for args),
and then cleans it all up.  It&rsquo;s very expensive but it&rsquo;s also something I can
use thoughtlessly and I really like that.
</p>

<p>
Here&rsquo;s an example run:
</p>

<pre class="example" id="orge0d4d8d">
@ ./with-podman.sh ls -al
Error: podman-machine-default: VM already exists
Error: cannot start VM podman-machine-default: VM already running or starting
a34354199be6cca047309f9d29ecefeeb1c4521d776536cc6305bad8380874b6
nix-run
total 12
drwxr-xr-x 11 root nobody  352 Dec 24 13:17 .
dr-xr-xr-x  1 root root     77 Dec 24 13:26 ..
drwxr-xr-x 10 root nobody  320 Dec 24 13:23 .git
-rw-r--r--  1 root nobody  283 Dec 22 00:50 README.org
-rw-r--r--  1 root nobody 3809 Dec 24 00:29 flake.nix
drwxr-xr-x  3 root nobody   96 Dec 24 00:30 hosts
drwxr-xr-x  4 root nobody  128 Dec 24 00:40 modules
drwxr-xr-x  3 root nobody   96 Dec 24 00:42 pkgs
drwxr-xr-x  3 root nobody   96 Dec 24 00:52 profiles
drwxr-xr-x  4 root nobody  128 Dec 24 00:41 shell
-rwxr-xr-x  1 root nobody  529 Dec 24 13:26 with-podman.sh
nix-run
Waiting for VM to exit...
Machine "podman-machine-default" stopped successfully

~/dev/proton-nix logan@scandium 0 [22:27:20] 75s
$
</pre>

<p>
Note it took 75 seconds to run on my system just to do <code>ls</code> but it works without
me doing anything fancy, I&rsquo;m running <code>NixOS</code>, and the repository I&rsquo;m working in
is properly volume mounted.  I&rsquo;m not really worried about speed here, especially
because these invocations I&rsquo;m about to do will generate disk images - an already
lengthy affair I expect to take on the order of minutes.  Perhaps I will find
short cuts to speed up iteration as I experience pain with building the image
improperly, but I want to reserve my grease until the wheels begin to squeak.
</p>

<p>
A couple of asides:
</p>

<ol class="org-ol">
<li>I looked at <code>Just</code> since this is my first exposure to it.  From some quick
reading around, it seems to be a marginally better <code>make</code>.  <code>make</code> is
portable, standard, and yes it has aged but I believe it has aged moderately
well.  I would not drop portability and familiarity (due to it being fairly
standard) just for a marginal improvement.  Plus, if the file starts to get
too squirrelly, I&rsquo;d rather just break out the complex bits into standalone
scripts.  If I really could wave a wand and have anything I wanted in terms
of love to <code>make</code>, it would be to give me something like <code>rake -T</code> where I
can simply print all of the tasks available to me.  Reading the code is <span class="underline">not</span>
documentation, even if it is a <code>Makefile</code>.</li>
<li>I tend to go down the rabbit hole on a lot of these ventures, but I&rsquo;m not
posting all of it as I go.  Indeed, I just closed a tab pointing to
<code>r/programminganimememes</code>, which was serving as nothing other than pure
distraction.  I&rsquo;d followed link to it from the same article linked above.</li>
</ol>

<p>
Now that I have a real Nix system available to me, I need to try to run my
paired down repository from <code>sweenu</code> and see if I can build an image from it.
</p>
</div>
</div>
