nix-adventures-01.org
*** Trying to Make it Work with =digga=
:PROPERTIES:
:CUSTOM_ID: building-the-image--building-the-nixos-pi-image--trying-to-make-it-work-with-=digga=
:END:
From =sweenu='s earlier invocations, I have adapted it to be:

#+begin_src shell :results none :exports code
./with-podman.sh "
nixos-generate --flake '.#iron' --format sd-aarch64 --system aarch64-linux;
"
#+end_src

Which outputs:

#+begin_example
Error: crun: executable file `nixos-generate` not found in $PATH: No such file or directory: OCI runtime attempted to invoke a command that was not found
Error: read unixpacket @->/proc/self/fd/13/attach: read: connection reset by peer
#+end_example

I hope that =unixpacket= error is just some weirdness with error handling - an
error of an error.  I'll test again with =ls -al=... and the results are the
same successful results I had before.  I even tried with ="ls -al"= to make sure
there isn't some weird quoting issues, but there isn't - all is well.

I tried a nix invocation I know to work:

#+begin_src shell :results none :exports code
./with-podman.sh nix-channel --list
#+end_src

And I get:

#+begin_example
nixpkgs https://nixos.org/channels/nixpkgs-unstable
#+end_example

Which is a very reasonable/expected output.  So some nix tools are available,
but why can't it find =nixos-genereate=?  This is literally my first time using
any command prefixed with =nixos=, so I'm assuming that this command _actually
exists under normal circumstances_ and that might be too heavy an assumption.
Some searching reveals... nothing?  Not at all what I expected.  I expected
_something_, but just not on my path for whatever reason.  I double check and
realize I'm searching for =nix-generate= instead of =nixos-generate=, whoops.

=nixos-genereate= is supplied by [[https://github.com/nix-community/nixos-generators][nixos-generators]] and it requires installation -
it's no something that ships with =nixos=.

#+begin_src shell :results none :exports code
./with-podman.sh "
nix run github:nix-community/nixos-generators -- \
  --flake '.#iron' --format sd-aarch64 --system aarch64-linux;
"
#+end_src

And I get:

#+begin_example
error: experimental Nix feature 'nix-command' is disabled; add '--extra-experimental-features nix-command' to enable it
#+end_example

Ah.  I've seen these before.  This just makes our invocation a little more
tricky with:

#+begin_src shell :results none :exports code
./with-podman.sh "
nix --extra-experimental-features nix-command \
  run github:nix-community/nixos-generators -- \
    --flake '.#iron' --format sd-aarch64 --system aarch64-linux;
"
#+end_src

The complexity and nesting here is starting to make me a little nervous.  Prior
+trauma+ experience tells me that I will soon be running into shell quoting
issues.

Now I see:

#+begin_example
error: experimental Nix feature 'flakes' is disabled; add '--extra-experimental-features flakes' to enable it
#+end_example

Sigh.  Nix, you couldn't have told me about _both_ of them at once?
Furthermore, it would've told me the proper thing to do for enabling multiple
experimental features at once.  So I wing it:

#+begin_src shell :results none :exports code
./with-podman.sh "
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  run github:nix-community/nixos-generators -- \
    --flake '.#iron' --format sd-aarch64 --system aarch64-linux;
"
#+end_src

I see a lot of stuff going on with the nix store - a sign of progress!

But we end with:

#+begin_example
warning: Ignoring setting 'auto-allocate-uids' because experimental feature 'auto-allocate-uids' is not enabled
warning: Ignoring setting 'impure-env' because experimental feature 'configurable-impure-env' is not enabled
building '/nix/store/531cw9n4lxqx3w830ijackc5xffgz27k-nixos-generate.drv'...
/nix/store/7nkr6ysd859f6pwsn0k32qr8w368rmcz-nixos-generate/bin/.nixos-generate-wrapped: line 72: awk: command not found
#+end_example

You'd think =nixos-generators= would just include =awk=.  Maybe I can submit a
PR...?  Let's cook a new invocation:

#+begin_src shell :results none :exports code
./with-podman.sh "
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  run awk github:nix-community/nixos-generators -- \
    --flake '.#iron' --format sd-aarch64 --system aarch64-linux;
"
#+end_src

I get:

#+begin_example
error: cannot find flake 'flake:awk' in the flake registries
#+end_example

It should be noted the =pkg1 pkg2...= notation I used is taken from the
explanation in this [[https://discourse.nixos.org/t/difference-between-nix-shell-and-nix-run/2951][Discourse about nix shell vs nix run]] but the help/man page
for =nix run= gives no indication that this can be done.  If anything it
indicates that this _cannot_ be done because the invocation demands
=installable= as a single argument and other arguments have flags.

More reading in that same Discourse shows that =nix run= might not be suitable
for this, or is otherwise a work in progress.  Okay fine.  I find some
suggestions on =nix shell= that do what I want in the same Discourse once again.
Let's try it out.

Actually I try several things out, and eventually land on:

#+begin_src shell :results none :exports code
./with-podman.sh "
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  shell awk github:nix-community/nixos-generators -- \
    --flake '.#iron' --format sd-aarch64 --system aarch64-linux;
"
#+end_src

I ran into:

#+begin_example
path '/workdir/--flake' does not contain a 'flake.nix', searching up
error: getting status of '/workdir/--flake': No such file or directory
#+end_example

So I just remove =--flake= and use:

#+begin_src shell :results none :exports code
./with-podman.sh "
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  run 'nixpkgs#awk' github:LoganBarnett/nixos-generators#with-awk -- \
    --flake '.#iron' --format sd-aarch64 --system aarch64-linux;
"
#+end_src

To get:

#+begin_example

#+end_example

#+begin_src shell :results none :exports code
./with-podman.sh "
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  shell \
      -c \
         "'"'"nixos-generate \
                             --flake '.#iron' \
                             --format sd-aarch64 \
                             --system aarch64-linux \
         "'"'"
"
#+end_src

Ugh I really went off the tracks trying things out.  I have an incantation that
finally exercises the bits I want, but the actual nix code is busted somehow.  I
suspect the version of =digga= that =sweenu= uses and my own differ.  I need to
look into some more things.  I wonder if I can just use =nixos-generate= by
itself, without all of this extra stuff?  My other two paths are to either pin
my repo to the same version that =sweenu= has in the =flake.lock= or follow
another example (https://github.com/divnix/digga/pull/501 for a working(?) one).

#+begin_src shell :results none :exports code
./with-podman.sh " \
ls -al . ;
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  build '.#iron' \
"
#+end_src

This invocation helps a lot, and keeps it so I don't need to keep running
directly on the VM while still working out silly issues.

#+begin_src shell :results none :exports code
nix flake check --show-trace
#+end_src

This is the point where I just tried a bunch of different things.  Many a straw
were grasped.  I tried following obscure error messages.  The sight of broken
"magic" is not new to me, and this section of stuff really felt like it.  So I
abandoned =digga= entirely.


