nix-adventures-01.html
<div id="outline-container-building-the-image--building-the-nixos-pi-image" class="outline-3">
<h3 id="building-the-image--building-the-nixos-pi-image"><span class="section-number-3">7.3.</span> Building the NixOS Pi image</h3>
<div class="outline-text-3" id="text-building-the-image--building-the-nixos-pi-image">
</div>
<div id="outline-container-building-the-image--building-the-nixos-pi-image--trying-to-make-it-work-with-=digga=" class="outline-4">
<h4 id="building-the-image--building-the-nixos-pi-image--trying-to-make-it-work-with-=digga="><span class="section-number-4">7.3.1.</span> Trying to Make it Work with <code>digga</code></h4>
<div class="outline-text-4" id="text-building-the-image--building-the-nixos-pi-image--trying-to-make-it-work-with-=digga=">
<p>
From <code>sweenu</code>&rsquo;s earlier invocations, I have adapted it to be:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org1aa8167">./with-podman.sh <span style="color: #7bc275;">"</span>
<span style="color: #7bc275;">nixos-generate --flake '.#iron' --format sd-aarch64 --system aarch64-linux;</span>
<span style="color: #7bc275;">"</span>
</pre>
</div>

<p>
Which outputs:
</p>

<pre class="example" id="org09588f9">
Error: crun: executable file `nixos-generate` not found in $PATH: No such file or directory: OCI runtime attempted to invoke a command that was not found
Error: read unixpacket @-&gt;/proc/self/fd/13/attach: read: connection reset by peer
</pre>

<p>
I hope that <code>unixpacket</code> error is just some weirdness with error handling - an
error of an error.  I&rsquo;ll test again with <code>ls -al</code>&#x2026; and the results are the
same successful results I had before.  I even tried with <code>"ls -al"</code> to make sure
there isn&rsquo;t some weird quoting issues, but there isn&rsquo;t - all is well.
</p>

<p>
I tried a nix invocation I know to work:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org13050f5">./with-podman.sh nix-channel --list
</pre>
</div>

<p>
And I get:
</p>

<div class="org-src-container">
<pre class="src src-:exports" id="orgecca946">nixpkgs https://nixos.org/channels/nixpkgs-unstable
</pre>
</div>

<p>
Which is a very reasonable/expected output.  So some nix tools are available,
but why can&rsquo;t it find <code>nixos-genereate</code>?  This is literally my first time using
any command prefixed with <code>nixos</code>, so I&rsquo;m assuming that this command <span class="underline">actually
exists under normal circumstances</span> and that might be too heavy an assumption.
Some searching reveals&#x2026; nothing?  Not at all what I expected.  I expected
<span class="underline">something</span>, but just not on my path for whatever reason.  I double check and
realize I&rsquo;m searching for <code>nix-generate</code> instead of <code>nixos-generate</code>, whoops.
</p>

<p>
<code>nixos-genereate</code> is supplied by <a href="https://github.com/nix-community/nixos-generators">nixos-generators</a> and it requires installation -
it&rsquo;s not something that ships with <code>nixos</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org0a1c5b9">./with-podman.sh <span style="color: #7bc275;">"</span>
<span style="color: #7bc275;">nix run github:nix-community/nixos-generators -- \</span>
<span style="color: #7bc275;">  --flake '.#iron' --format sd-aarch64 --system aarch64-linux;</span>
<span style="color: #7bc275;">"</span>
</pre>
</div>

<p>
And I get:
</p>

<pre class="example" id="orgf39acb5">
error: experimental Nix feature 'nix-command' is disabled; add '--extra-experimental-features nix-command' to enable it
</pre>

<p>
Ah.  I&rsquo;ve seen these before.  This just makes our invocation a little more
tricky with:
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">"</span>
<span style="color: #7bc275;">nix --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  run github:nix-community/nixos-generators -- \</span>
<span style="color: #7bc275;">    --flake '.#iron' --format sd-aarch64 --system aarch64-linux;</span>
<span style="color: #7bc275;">"</span>
</pre>
</div>

<p>
The complexity and nesting here is starting to make me a little nervous.  Prior
<del>trauma</del> experience tells me that I will soon be running into shell quoting
issues.
</p>

<p>
Now I see:
</p>

<pre class="example" id="org29f5d7a">
error: experimental Nix feature 'flakes' is disabled; add '--extra-experimental-features flakes' to enable it
</pre>

<p>
Sigh.  Nix, you couldn&rsquo;t have told me about <span class="underline">both</span> of them at once?
Furthermore, it would&rsquo;ve told me the proper thing to do for enabling multiple
experimental features at once.  So I wing it:
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">"</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  run github:nix-community/nixos-generators -- \</span>
<span style="color: #7bc275;">    --flake '.#iron' --format sd-aarch64 --system aarch64-linux;</span>
<span style="color: #7bc275;">"</span>
</pre>
</div>

<p>
I see a lot of stuff going on with the nix store - a sign of progress!
</p>

<p>
But we end with:
</p>

<pre class="example" id="org0f0bcd0">
warning: Ignoring setting 'auto-allocate-uids' because experimental feature 'auto-allocate-uids' is not enabled
warning: Ignoring setting 'impure-env' because experimental feature 'configurable-impure-env' is not enabled
building '/nix/store/531cw9n4lxqx3w830ijackc5xffgz27k-nixos-generate.drv'...
/nix/store/7nkr6ysd859f6pwsn0k32qr8w368rmcz-nixos-generate/bin/.nixos-generate-wrapped: line 72: awk: command not found
</pre>

<p>
You&rsquo;d think <code>nixos-generators</code> would just include <code>awk</code>.  Maybe I can submit a
PR&#x2026;?  Let&rsquo;s cook a new invocation:
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">"</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  run awk github:nix-community/nixos-generators -- \</span>
<span style="color: #7bc275;">    --flake '.#iron' --format sd-aarch64 --system aarch64-linux;</span>
<span style="color: #7bc275;">"</span>
</pre>
</div>

<p>
I get:
</p>

<pre class="example" id="org0c4e3b2">
error: cannot find flake 'flake:awk' in the flake registries
</pre>

<p>
It should be noted the <code>pkg1 pkg2...</code> notation I used is taken from the
explanation in this <a href="https://discourse.nixos.org/t/difference-between-nix-shell-and-nix-run/2951">Discourse about nix shell vs nix run</a> but the help/man page
for <code>nix run</code> gives no indication that this can be done.  If anything it
indicates that this <span class="underline">cannot</span> be done because the invocation demands
<code>installable</code> as a single argument and other arguments have flags.
</p>

<p>
More reading in that same Discourse shows that <code>nix run</code> might not be suitable
for this, or is otherwise a work in progress.  Okay fine.  I find some
suggestions on <code>nix shell</code> that do what I want in the same Discourse once again.
Let&rsquo;s try it out.
</p>

<p>
Actually I try several things out, and eventually land on:
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">"</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  shell awk github:nix-community/nixos-generators -- \</span>
<span style="color: #7bc275;">    --flake '.#iron' --format sd-aarch64 --system aarch64-linux;</span>
<span style="color: #7bc275;">"</span>
</pre>
</div>

<p>
I ran into:
</p>

<pre class="example" id="orge871be6">
path '/workdir/--flake' does not contain a 'flake.nix', searching up
error: getting status of '/workdir/--flake': No such file or directory
</pre>

<p>
So I just remove <code>--flake</code> and use:
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">"</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  run 'nixpkgs#awk' github:LoganBarnett/nixos-generators#with-awk -- \</span>
<span style="color: #7bc275;">    --flake '.#iron' --format sd-aarch64 --system aarch64-linux;</span>
<span style="color: #7bc275;">"</span>
</pre>
</div>

<p>
To get:
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">"</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  shell \</span>
<span style="color: #7bc275;">      -c \</span>
<span style="color: #7bc275;">         "'"'"nixos-generate \</span>
<span style="color: #7bc275;">                             --flake '.#iron' \</span>
<span style="color: #7bc275;">                             --format sd-aarch64 \</span>
<span style="color: #7bc275;">                             --system aarch64-linux \</span>
<span style="color: #7bc275;">         "'"'"</span>
<span style="color: #7bc275;">"</span>
</pre>
</div>

<p>
Ugh I really went off the tracks trying things out.  I have an incantation that
finally exercises the bits I want, but the actual nix code is busted somehow.  I
suspect the version of <code>digga</code> that <code>sweenu</code> uses and my own differ.  I need to
look into some more things.  I wonder if I can just use <code>nixos-generate</code> by
itself, without all of this extra stuff?  My other two paths are to either pin
my repo to the same version that <code>sweenu</code> has in the <code>flake.lock</code> or follow
another example (<a href="https://github.com/divnix/digga/pull/501">https://github.com/divnix/digga/pull/501</a> for a working(?) one).
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">" \</span>
<span style="color: #7bc275;">ls</span><span style="color: #7bc275;"> -al . ;</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  build '.#iron' \</span>
<span style="color: #7bc275;">"</span>
</pre>
</div>

<p>
This invocation helps a lot, and keeps it so I don&rsquo;t need to keep running
directly on the VM while still working out silly issues.
</p>

<div class="org-src-container">
<pre class="src src-shell">nix flake check --show-trace
</pre>
</div>

<p>
This is the point where I just tried a bunch of different things.  Many a straw
were grasped.  I tried following obscure error messages.  The sight of broken
&ldquo;magic&rdquo; is not new to me, and this section of stuff really felt like it.  So I
abandoned <code>digga</code> entirely.
</p>
</div>
</div>
