nix-adventures-01.org
*** Just Use =nix-generators=
:PROPERTIES:
:CUSTOM_ID: building-the-image--building-the-nixos-pi-image--just-use-=nix-generators=
:END:

Now I have the following configuration:

The =flake.nix=:

#+begin_src nix :results none :exports code
{
  description = ''iron.proton imaging and configuration.
iron.proton is a cross-region routing device.
'';
  inputs = {
    nixpkgs.url = "nixpkgs/nixos-unstable";
    nixos-generators = {
      url = "github:nix-community/nixos-generators";
      inputs.nixpkgs.follows = "nixpkgs";
    };
  };
  outputs = { self, nixpkgs, nixos-generators, ... }: {
    packages.aarch64-linux = {
      iron = nixos-generators.nixosGenerate {
        format = "sd-aarch64";
        modules = [
          ./iron-configuration.nix
        ];
        system = "aarch64-linux";
      };
    };
  };
}
#+end_src

The linked =iron-configuration.nix= is this:

#+begin_src nix :results none :exports code
# This is the NixOS configuration for iron.proton.  It is drawn from the example
# here:
# https://github.com/Misterio77/nix-starter-configs/blob/main/minimal/nixos/configuration.nix
{
  inputs,
  lib,
  config,
  pkgs,
  ...
}: {
  imports = [
    ./hardware-configuration.nix
  ];

  nixpkgs = {
    overlays = [
    ];
    config = {
      allowUnfree = true;
    };
  };
  nix.nixPath = ["/etc/nix/path"];
  environment.etc =
    lib.mapAttrs'
    (name: value: {
      name = "nix/path/${name}";
      value.source = value.flake;
    })
    config.nix.registry;
  nix.settings = {
    experimental-features = "nix-command flakes";
    auto-optimise-store = true;
  };
  networking.hostName = "iron";
  # TODO: This is just an example, be sure to use whatever bootloader you prefer
  # I guess grub or whatever is used implicitly somewhere?  Keeping this (which
  # comes from the example verbatim) results in:
  #   The option `system.build.installBootLoader' is defined multiple times
  #   while it's expected to be unique.
  # boot.loader.systemd-boot.enable = true;
  users.users = {
    logan = {
      # TODO: You can set an initial password for your user.
      # If you do, you can skip setting a root password by passing
      # '--no-root-passwd' to nixos-install.
      # Be sure to change it (using passwd) after rebooting!
      initialPassword = "correcthorsebatterystaple";
      isNormalUser = true;
      openssh.authorizedKeys.keys = [
        "my public key"
      ];
      extraGroups = ["wheel"];
    };
  };
  services.openssh = {
    enable = true;
    settings = {
      # Forbid root login through SSH.
      PermitRootLogin = "no";
      # Use keys only. Remove if you want to SSH using password (not
      # recommended).
      PasswordAuthentication = false;
    };
  };
  system.stateVersion = "23.05";
}
#+end_src

And then =hardware-configuration.nix= is this:

#+begin_src nix :results none :exports code :exports code
{
  fileSystems."/" = {
    # Must match what sd-image expects exactly.  This is found by trying to run
    # anything and then encountering an error.
    device = "/dev/disk/by-label/NIXOS_SD";
    fsType = "ext4";
  };
  nixpkgs.hostPlatform = "aarch64-linux";
}
#+end_src

If you're comparing from the [[https://github.com/Misterio77/nix-starter-configs/blob/main/minimal/nixos/configuration.nix][example]] mentioned in the comments, this does
without the =nix.registry= setting because that was causing problems.  I also
removed the boot loader declaration, because that seems to be implicit or
configured in some other way that is not obvious to me.

The error for the boot loader is this:

#+begin_example
error: The option `system.build.installBootLoader' is defined multiple times while it's expected to be unique.
       Only one bootloader can be enabled at a time. This requirement has not
       been checked until NixOS 22.05. Earlier versions defaulted to the last
       definition. Change your configuration to enable only one bootloader.
#+end_example

Unfortunately I don't have an error capture for =nix.registry=.

The =nix.registry= error:

#+begin_example
error:
       … while calling the 'derivationStrict' builtin

         at /derivation-internal.nix:9:12:

            8|
            9|   strict = derivationStrict drvAttrs;
             |            ^
           10|

       … while evaluating derivation 'nixos-sd-image-24.05.20231222.6df37dc-aarch64-linux.img'
         whose name attribute is located at /nix/store/55ql4j8d47xjvfa8xggjddgfwny4n9j7-source/pkgs/stdenv/generic/make-derivation.nix:348:7

       … while evaluating attribute 'buildCommand' of derivation 'nixos-sd-image-24.05.20231222.6df37dc-aarch64-linux.img'

         at /nix/store/55ql4j8d47xjvfa8xggjddgfwny4n9j7-source/nixos/modules/installer/sd-card/sd-image.nix:182:7:

          181|
          182|       buildCommand = ''
             |       ^
          183|         mkdir -p $out/nix-support $out/sd-image

       (stack trace truncated; use '--show-trace' to show the full trace)

       error: attribute 'inputs' missing

       at /nix/store/55ql4j8d47xjvfa8xggjddgfwny4n9j7-source/lib/modules.nix:508:28:

          507|         builtins.addErrorContext (context name)
          508|           (args.${name} or config._module.args.${name})
             |                            ^
          509|       ) (lib.functionArgs f);
#+end_example

Divining the fix was mostly a guess, but based on:
1. The =inputs= missing.  The =nix.registry= line has =inputs= in there.
2. The =nix.registry= line has a comment saying "To make nix3 commands
   consistent with your flake" and this looks like speculative future-proofing
   to me.  The future is likely now, and the speculation proven false.
3. I have =inputs= very clearly in the flake.  Everything else looks "tidy".

Okay so this all generates an image by running:

#+begin_src shell :results output :exports code
./with-podman.sh " \
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  build '.#iron' \
"
#+end_src

I get no meaningful output, but no news is good news in the Unix world.  I see
that my local directory gets an =result= file.  It's a symlink.

#+begin_example
result -> /nix/store/dv21jmin4aqq4m0zvlbfbw2d6c1d47sr-nixos-sd-image-24.05.20231222.6df37dc-aarch64-linux.img
#+end_example

