nix-adventures-01.html
<div id="outline-container-building-the-image--building-the-nixos-pi-image--just-use-=nix-generators=" class="outline-4">
<h4 id="building-the-image--building-the-nixos-pi-image--just-use-=nix-generators="><span class="section-number-4">7.3.2.</span> Just Use <code>nix-generators</code></h4>
<div class="outline-text-4" id="text-building-the-image--building-the-nixos-pi-image--just-use-=nix-generators=">
<p>
Now I have the following configuration:
</p>

<p>
The <code>flake.nix</code>:
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: #51afef;">{</span>
  <span style="color: #dcafe9;">description</span> = <span style="color: #7bc275;">''iron.proton imaging and configuration.</span>
<span style="color: #7bc275;">iron.proton is a cross-region routing device.</span>
<span style="color: #7bc275;">''</span>;
  <span style="color: #dcafe9;">inputs</span> = <span style="color: #C57BDB;">{</span>
    <span style="color: #dcafe9;">nixpkgs.url</span> = <span style="color: #7bc275;">"nixpkgs/nixos-unstable"</span>;
    <span style="color: #dcafe9;">nixos-generators</span> = <span style="color: #7bc275;">{</span>
      <span style="color: #dcafe9;">url</span> = <span style="color: #7bc275;">"github:nix-community/nixos-generators"</span>;
      <span style="color: #dcafe9;">inputs.nixpkgs.follows</span> = <span style="color: #7bc275;">"nixpkgs"</span>;
    <span style="color: #7bc275;">}</span>;
  <span style="color: #C57BDB;">}</span>;
  <span style="color: #dcafe9;">outputs</span> = <span style="color: #C57BDB;">{</span> self, nixpkgs, nixos-generators, ... <span style="color: #C57BDB;">}</span>: <span style="color: #C57BDB;">{</span>
    <span style="color: #dcafe9;">packages.aarch64-linux</span> = <span style="color: #7bc275;">{</span>
      <span style="color: #dcafe9;">iron</span> = nixos-generators.nixosGenerate <span style="color: #a991f1;">{</span>
        <span style="color: #dcafe9;">format</span> = <span style="color: #7bc275;">"sd-aarch64"</span>;
        <span style="color: #dcafe9;">modules</span> = <span style="color: #51afef;">[</span>
          <span style="color: #a991f1;">./iron-configuration.nix</span>
        <span style="color: #51afef;">]</span>;
        <span style="color: #dcafe9;">system</span> = <span style="color: #7bc275;">"aarch64-linux"</span>;
      <span style="color: #a991f1;">}</span>;
    <span style="color: #7bc275;">}</span>;
  <span style="color: #C57BDB;">}</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
The linked <code>iron-configuration.nix</code> is this:
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: #62686E;"># </span><span style="color: #62686E;">This is the NixOS configuration for iron.proton.  It is drawn from the example</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">here:</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">https://github.com/Misterio77/nix-starter-configs/blob/main/minimal/nixos/conf</span><span style="color: #ff665c; background-color: #1c1f24; font-weight: bold;">iguration.nix</span>
<span style="color: #51afef;">{</span>
  inputs,
  lib,
  config,
  pkgs,
  ...
<span style="color: #51afef;">}</span>: <span style="color: #51afef;">{</span>
  <span style="color: #dcafe9;">imports</span> = <span style="color: #C57BDB;">[</span>
    <span style="color: #a991f1;">./hardware-configuration.nix</span>
  <span style="color: #C57BDB;">]</span>;

  <span style="color: #dcafe9;">nixpkgs</span> = <span style="color: #C57BDB;">{</span>
    <span style="color: #dcafe9;">overlays</span> = <span style="color: #7bc275;">[</span>
    <span style="color: #7bc275;">]</span>;
    <span style="color: #dcafe9;">config</span> = <span style="color: #7bc275;">{</span>
      <span style="color: #dcafe9;">allowUnfree</span> = <span style="color: #C57BDB;">true</span>;
    <span style="color: #7bc275;">}</span>;
  <span style="color: #C57BDB;">}</span>;
  <span style="color: #dcafe9;">nix.nixPath</span> = <span style="color: #C57BDB;">[</span><span style="color: #7bc275;">"/etc/nix/path"</span><span style="color: #C57BDB;">]</span>;
  <span style="color: #dcafe9;">environment.etc</span> =
    lib.mapAttrs'
    <span style="color: #C57BDB;">(</span>name: value: <span style="color: #7bc275;">{</span>
      <span style="color: #dcafe9;">name</span> = <span style="color: #7bc275;">"nix/path/</span><span style="color: #C57BDB; font-weight: bold;">$</span><span style="color: #a991f1; font-weight: bold;">{</span>name<span style="color: #a991f1; font-weight: bold;">}</span>";
      <span style="color: #dcafe9;">value.source</span> = value.flake;
    <span style="color: #7bc275;">}</span><span style="color: #C57BDB;">)</span>
    config.nix.registry;
  <span style="color: #dcafe9;">nix.settings</span> = <span style="color: #C57BDB;">{</span>
    <span style="color: #dcafe9;">experimental-features</span> = <span style="color: #7bc275;">"nix-command flakes"</span>;
    <span style="color: #dcafe9;">auto-optimise-store</span> = <span style="color: #C57BDB;">true</span>;
  <span style="color: #C57BDB;">}</span>;
  <span style="color: #dcafe9;">networking.hostName</span> = <span style="color: #7bc275;">"iron"</span>;
  <span style="color: #62686E;"># </span><span style="color: #FCCE7B; font-weight: bold;">TODO:</span><span style="color: #62686E;"> This is just an example, be sure to use whatever bootloader you prefer</span>
  <span style="color: #62686E;"># I guess grub or whatever is used implicitly somewhere?  Keeping this (which</span>
  <span style="color: #62686E;"># comes from the example verbatim) results in:</span>
  <span style="color: #62686E;">#   The option `system.build.installBootLoader' is defined multiple times</span>
  <span style="color: #62686E;">#   while it's expected to be unique.</span>
  <span style="color: #62686E;"># boot.loader.systemd-boot.enable = true;</span>
  <span style="color: #dcafe9;">users.users</span> = <span style="color: #C57BDB;">{</span>
    <span style="color: #dcafe9;">logan</span> = <span style="color: #7bc275;">{</span>
      <span style="color: #62686E;"># </span><span style="color: #FCCE7B; font-weight: bold;">TODO:</span><span style="color: #62686E;"> You can set an initial password for your user.</span>
      <span style="color: #62686E;"># If you do, you can skip setting a root password by passing</span>
      <span style="color: #62686E;"># '--no-root-passwd' to nixos-install.</span>
      <span style="color: #62686E;"># Be sure to change it (using passwd) after rebooting!</span>
      <span style="color: #dcafe9;">initialPassword</span> = <span style="color: #7bc275;">"correcthorsebatterystaple"</span>;
      <span style="color: #dcafe9;">isNormalUser</span> = <span style="color: #C57BDB;">true</span>;
      <span style="color: #dcafe9;">openssh.authorizedKeys.keys</span> = <span style="color: #a991f1;">[</span>
        <span style="color: #7bc275;">"my public key"</span>
      <span style="color: #a991f1;">]</span>;
      <span style="color: #dcafe9;">extraGroups</span> = <span style="color: #a991f1;">[</span><span style="color: #7bc275;">"wheel"</span><span style="color: #a991f1;">]</span>;
    <span style="color: #7bc275;">}</span>;
  <span style="color: #C57BDB;">}</span>;
  <span style="color: #dcafe9;">services.openssh</span> = <span style="color: #C57BDB;">{</span>
    <span style="color: #dcafe9;">enable</span> = <span style="color: #C57BDB;">true</span>;
    <span style="color: #dcafe9;">settings</span> = <span style="color: #7bc275;">{</span>
      <span style="color: #62686E;"># Forbid root login through SSH.</span>
      <span style="color: #dcafe9;">PermitRootLogin</span> = <span style="color: #7bc275;">"no"</span>;
      <span style="color: #62686E;"># Use keys only. Remove if you want to SSH using password (not</span>
      <span style="color: #62686E;"># recommended).</span>
      <span style="color: #dcafe9;">PasswordAuthentication</span> = <span style="color: #C57BDB;">false</span>;
    <span style="color: #7bc275;">}</span>;
  <span style="color: #C57BDB;">}</span>;
  <span style="color: #dcafe9;">system.stateVersion</span> = <span style="color: #7bc275;">"23.05"</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
And then <code>hardware-configuration.nix</code> is this:
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: #51afef;">{</span>
  fileSystems.<span style="color: #7bc275;">"/"</span> = <span style="color: #C57BDB;">{</span>
    <span style="color: #62686E;"># Must match what sd-image expects exactly.  This is found by trying to run</span>
    <span style="color: #62686E;"># anything and then encountering an error.</span>
    <span style="color: #dcafe9;">device</span> = <span style="color: #7bc275;">"/dev/disk/by-label/NIXOS_SD"</span>;
    <span style="color: #dcafe9;">fsType</span> = <span style="color: #7bc275;">"ext4"</span>;
  <span style="color: #C57BDB;">}</span>;
  <span style="color: #dcafe9;">nixpkgs.hostPlatform</span> = <span style="color: #7bc275;">"aarch64-linux"</span>;
<span style="color: #51afef;">}</span>
</pre>
</div>

<p>
If you&rsquo;re comparing from the <a href="https://github.com/Misterio77/nix-starter-configs/blob/main/minimal/nixos/configuration.nix">example</a> mentioned in the comments, this does
without the <code>nix.registry</code> setting because that was causing problems.  I also
removed the boot loader declaration, because that seems to be implicit or
configured in some other way that is not obvious to me.
</p>

<p>
The error for the boot loader is this:
</p>

<pre class="example" id="org2093a78">
error: The option `system.build.installBootLoader' is defined multiple times while it's expected to be unique.
       Only one bootloader can be enabled at a time. This requirement has not
       been checked until NixOS 22.05. Earlier versions defaulted to the last
       definition. Change your configuration to enable only one bootloader.
</pre>

<p>
Unfortunately I don&rsquo;t have an error capture for <code>nix.registry</code>.
</p>

<p>
The <code>nix.registry</code> error:
</p>

<pre class="example" id="orgf6ed8a8">
error:
        while calling the 'derivationStrict' builtin

         at /derivation-internal.nix:9:12:

            8|
            9|   strict = derivationStrict drvAttrs;
             |            ^
           10|

        while evaluating derivation 'nixos-sd-image-24.05.20231222.6df37dc-aarch64-linux.img'
         whose name attribute is located at /nix/store/55ql4j8d47xjvfa8xggjddgfwny4n9j7-source/pkgs/stdenv/generic/make-derivation.nix:348:7

        while evaluating attribute 'buildCommand' of derivation 'nixos-sd-image-24.05.20231222.6df37dc-aarch64-linux.img'

         at /nix/store/55ql4j8d47xjvfa8xggjddgfwny4n9j7-source/nixos/modules/installer/sd-card/sd-image.nix:182:7:

          181|
          182|       buildCommand = ''
             |       ^
          183|         mkdir -p $out/nix-support $out/sd-image

       (stack trace truncated; use '--show-trace' to show the full trace)

       error: attribute 'inputs' missing

       at /nix/store/55ql4j8d47xjvfa8xggjddgfwny4n9j7-source/lib/modules.nix:508:28:

          507|         builtins.addErrorContext (context name)
          508|           (args.${name} or config._module.args.${name})
             |                            ^
          509|       ) (lib.functionArgs f);
</pre>

<p>
Divining the fix was mostly a guess, but based on:
</p>
<ol class="org-ol">
<li>The <code>inputs</code> missing.  The <code>nix.registry</code> line has <code>inputs</code> in there.</li>
<li>The <code>nix.registry</code> line has a comment saying &ldquo;To make nix3 commands
consistent with your flake&rdquo; and this looks like speculative future-proofing
to me.  The future is likely now, and the speculation proven false.</li>
<li>I have <code>inputs</code> very clearly in the flake.  Everything else looks &ldquo;tidy&rdquo;.</li>
</ol>

<p>
Okay so this all generates an image by running:
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">" \</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  build '.#iron' \</span>
<span style="color: #7bc275;">"</span>
</pre>
</div>

<p>
I get no meaningful output, but no news is good news in the Unix world.  I see
that my local directory gets an <code>result</code> file.  It&rsquo;s a symlink.
</p>

<pre class="example" id="org9b9316f">
result -&gt; /nix/store/dv21jmin4aqq4m0zvlbfbw2d6c1d47sr-nixos-sd-image-24.05.20231222.6df37dc-aarch64-linux.img
</pre>
</div>
</div>
