nix-adventures-01.org
*** Extracting the Image
:PROPERTIES:
:CUSTOM_ID: building-the-image--building-the-nixos-pi-image--extracting-the-image
:END:

I quickly discovered that the symlink is orphaned.

#+begin_src shell :results output :dir ~/dev/proton-nix :cache yes :exports both
ls -al $(readlink result) 2>&1
#+end_src

#+RESULTS:
: ls: cannot access '/nix/store/dv21jmin4aqq4m0zvlbfbw2d6c1d47sr-nixos-sd-image-24.05.20231222.6df37dc-aarch64-linux.img': No such file or directory

I bet there is some =containerd= trickery going on here.  Here's what I think
is happening:

1. I know from my script in =with-podman.sh=, the container is volume-mounting
   =$HOME=.  It is _not_ volume mounting =/nix=.
2. The file is actually written to =/nix= in the container.  This is
   inaccessible to me once the container is shut down.
3. The symlink emitted isn't translated to whatever temporary file that podman
   is actually writing to.
4. Thus I am left with a dead symlink.

I think the way we can fix this is to copy the image and then remove symlink (to
keep things clean, it's not strictly necessary).

#+begin_src shell :results output :exports code
./with-podman.sh " \
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  build '.#iron'
cp \$(readlink result) /workdir/nixos-pi.img
rm result
"
#+end_src

This doesn't work because the symlink points a directory, and not the image file
itself.  I did some digging and found I can do this:

#+begin_src shell :results output :exports code
./with-podman.sh " \
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  build '.#iron'
cp \$(readlink result)/sd-image/* /workdir/nixos-pi.img.zst
rm result
"
#+end_src

Note the added =.zst=.  Also there is another directory adjacent to =sd-image=
called =nix-support=.  I'll take a look at that as I do more runs.

I do need to add the ability to decompress this image in preparation for =dd=.
Let's yank our earlier invocation and place it in this command chain.  If I
wanted to muck around with the container image itself, I could use
the =unzstd= invocation to specify an output directory, which means we avoid a
=cp= of the entire image.  I don't want to muck around with the container image
as much as I can though.

#+begin_src shell :results output :exports code
./with-podman.sh " \
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  build '.#iron'
ls -al \$(readlink result)/nix-support
cp \$(readlink result)/sd-image/* /workdir/nixos-pi-sd-image.img.zst
rm result
"
unzstd -d nixos-pi-sd-image.img.zst -o nixos-pi-sd-image.img
#+end_src

One of the things I really like about this journaled approach to exploration is
that it slows me down enough to ask questions that make me avoid pitfalls.  As I
am writing, I am thinking "How do I know the result from =unzstd= is _actually_
a valid image without having to push it through =dd= and then slotting the card
into the Pi?

Some quick searching reveals I can use =hdiutil imageinfo <file>= to get this
information.

Let's see if it tells us that it is _not_ looking at a valid image:

#+begin_src shell :results output :cache yes :exports both :dir ~/dev/proton-nix
hdiutil imageinfo nixos-pi-sd-image.img.zst 2>&1
echo $?
#+end_src

#+RESULTS[c2f871774dc277bbf643abbb2aa9adf647ef2f4c]:
: hdiutil: imageinfo failed - image not recognized
: 1

Excellent!  And the positive case?

#+begin_src shell :results output :cache yes :exports both :dir ~/dev/proton-nix
hdiutil imageinfo nixos-pi-sd-image.img 2>&1
echo $?
#+end_src

#+RESULTS[577dc412637ee3baa71b1c19d62ece333576c986]:
#+begin_example
Class Name: CRawDiskImage
Size Information:
	Total Bytes: 2829352960
	Compressed Ratio: 1
	Sector Count: 5526080
	Total Non-Empty Bytes: 2829352960
	Compressed Bytes: 2829352960
	Total Empty Bytes: 0
Checksum Type: none
Format: UDRW
partitions:
	partition-scheme: fdisk
	block-size: 512
	partitions:
		0:
			partition-name: Master Boot Record
			partition-start: 0
			partition-synthesized: true
			partition-length: 1
			partition-hint: MBR
			boot-code: 0x00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000004E6978210000
		1:
			partition-name:
			partition-start: 1
			partition-synthesized: true
			partition-length: 16383
			partition-hint: Apple_Free
		2:
			partition-start: 16384
			partition-number: 1
			partition-length: 61440
			partition-hint: DOS_FAT_32
			partition-filesystems:
				FAT16: FIRMWARE
		3:
			partition-start: 77824
			partition-number: 2
			partition-length: 5448256
			partition-hint: Linux_Ext2FS
	burnable: false
Format Description: raw read/write
Checksum Value:
Properties:
	Encrypted: false
	Kernel Compatible: true
	Checksummed: false
	Software License Agreement: false
	Partitioned: false
	Compressed: no
Segments:
	0: /Users/logan/dev/proton-nix/nixos-pi-sd-image.img
Backing Store Information:
	URL: file:///Users/logan/dev/proton-nix/nixos-pi-sd-image.img
	Name: nixos-pi-sd-image.img
	Class Name: CBSDBackingStore
Resize limits (per hdiutil resize -limits):
5526080	5526080	181452016
0
#+end_example

Wonderful!

We can incorporate that into our eventual script we'll be creating, just to
check on things.

#+begin_src shell :results output :exports code
./with-podman.sh " \
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  build '.#iron'
ls -al \$(readlink result)/nix-support
cp \$(readlink result)/sd-image/* /workdir/nixos-pi-sd-image.img.zst
rm result
"
unzstd -d nixos-pi-sd-image.img.zst -o nixos-pi-sd-image.img
rm nixos-pi-sd-image.img.zst
hdiutil imageinfo nixos-pi-sd-image.img
#+end_src

And then we can incorporate the =dd= invocation into it:

#+begin_src shell :results output :exports code
./with-podman.sh " \
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  build '.#iron'
ls -al \$(readlink result)/nix-support
cp \$(readlink result)/sd-image/* /workdir/nixos-pi-sd-image.img.zst
rm result
"
unzstd -d nixos-pi-sd-image.img.zst -o nixos-pi-sd-image.img
rm nixos-pi-sd-image.img.zst
hdiutil imageinfo nixos-pi-sd-image.img
sudo dd if=nixos-pi-sd-image.img of=/dev/disk4 bs=1M status=progress conv=fsync
#+end_src

Let's not run that yet, because just blindly doing =dd= on things under =/dev=
is inherently dangerous.  Is there a way we can query for a detachable disk?

There is for macOS, but it's not portable.  I have seen some mention that
=lsusb= works for non-USB storage devices (and by extension, =cyme= would as
well), but I have not observed that on my system.  Still, learning of =cyme= is
useful and it's been added to my toolbox for later.

This is what I came up with:

#+begin_src shell :results output :cache yes
system_profiler SPStorageDataType -json \
  | jq -r \
      '.SPStorageDataType.[]
        | select(.physical_drive.protocol == "Secure Digital")
        | .bsd_name' \
  | sed -E 's/s[0-9]+//'
#+end_src

#+RESULTS[0f5433952653539623496d78f36c84d213afb02d]:
: disk4

Note that this might not work if using a USB attached SD card.  This could be
the case if you're using a docking station setup on your Mac/MacBook, instead of
preferring the on-board SD card reader.

Okay so now we have the disk, dynamically.  We can just idiotically bail out if
more than one is found.  We should only find one and only one result.

Ugh.  I really wish we could actually replace Bash with a stronger scripting
language but with the same level of ubiquitousness.  This is what I was able to
put together for giving me a one-and-only-one search:

#+begin_src shell :results none :exports code
#!/usr/bin/env bash

set -euo pipefail

IFS=$'\n'
result=( $(system_profiler SPStorageDataType -json \
  | jq -r \
      '.SPStorageDataType.[]
        | select(.physical_drive.protocol == "Secure Digital")
        | .bsd_name' \
  | sed -E 's/s[0-9]+//'
) )
unset IFS
count="${#result[*]}"
if [[ $count != 1 ]]; then
  echo "Error: $result has $count results but we expect exactly 1." 1>&2
  exit 1
else
  echo -n $result
fi
#+end_src

I tested with 1 device and 4 devices, and got the results I wanted.

This leaves us with a final script of:

#+begin_src shell :results none :exports code
#!/usr/bin/env bash

./with-podman.sh " \
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  build '.#iron'
ls -al \$(readlink result)/nix-support
cp \$(readlink result)/sd-image/* /workdir/nixos-pi-sd-image.img.zst
rm result
"
unzstd -d nixos-pi-sd-image.img.zst -o nixos-pi-sd-image.img
rm nixos-pi-sd-image.img.zst
hdiutil imageinfo nixos-pi-sd-image.img
sudo dd \
     if=nixos-pi-sd-image.img \
     of=/dev/$(./sd-card-dev-find.sh) \
     bs=1M \
     status=progress \
     conv=fsync
#+end_src

I found as part of futzing with this that =SPStorageDataType= only works for
mounted devices but not available devices.  However I need things to be
unmounted to use =dd= on them.  This does not make it easy to do ephemeral runs.
If I wanted to always use =SPStorageDataType=, then I'd need to know _what_ to
mount, which is what I'm trying to determine in the first place.  Additionally,
the disk might be totally fresh or using some unknown filesystem - both of which
would render the device unmountable.  With some checking around from
=system_profiler -listDataTypes= I found =SPCardReaderDataType= which looks
promising:

#+begin_src shell :results output :cache yes
system_profiler SPCardReaderDataType
#+end_src

#+RESULTS[19c71eb3ef3a2a56e6f5087bdd4b3580460be0ed]:
#+begin_example
Card Reader:

    Built in SD Card Reader:

      Vendor ID: 0x17a0
      Device ID: 0x9755
      Subsystem Vendor ID: 0x17a0
      Subsystem ID: 0x9755
      Revision: 0x0001
      Link Width: x63

        SDXC Card (Class 10):

          Product Name: SDSN128
          Manufacturer ID: 0x03
          Revision: 8.6
          Serial Number: 2296909372
          Manufacturing Date: 2023-08
          Specification Version: 3.0
          Capacity: 127.87 GB (127,865,454,592 bytes)
          Removable Media: Yes
          BSD Name: disk4
          Partition Map Type: MBR (Master Boot Record)
          S.M.A.R.T. status: Verified
          Volumes:
            bootfs:
              Capacity: 536.9 MB (536,870,912 bytes)
              File System: MS-DOS FAT32
              BSD Name: disk4s1
              Content: Windows_FAT_32
              Volume UUID: 0A519004-FDF2-3BDA-9650-613B11B95AFF
            disk4s2:
              Capacity: 5.3 GB (5,297,405,952 bytes)
              BSD Name: disk4s2
              Content: Linux

#+end_example

And now the JSON form:


#+begin_src shell :results output :cache yes
system_profiler SPCardReaderDataType -json
#+end_src

#+RESULTS[ecedc82eca39566dcfc2beea315e4a30bf72e5e6]:
#+begin_example
{
  "SPCardReaderDataType" : [
    {
      "_items" : [
        {
          "_name" : "SDXC Card (Class 10)",
          "bsd_name" : "disk4",
          "partition_map_type" : "master_boot_record_partition_map_type",
          "removable_media" : "yes",
          "size" : "127.87 GB",
          "size_in_bytes" : 127865454592,
          "smart_status" : "Verified",
          "spcardreader_card_manufacturer-id" : "0x03",
          "spcardreader_card_manufacturing_date" : "2023-08",
          "spcardreader_card_productname" : "SDSN128",
          "spcardreader_card_productrevision" : "8.6",
          "spcardreader_card_serialnumber" : "2296909372",
          "spcardreader_card_specversion" : "3.0",
          "volumes" : [
            {
              "_name" : "bootfs",
              "bsd_name" : "disk4s1",
              "file_system" : "MS-DOS FAT32",
              "iocontent" : "Windows_FAT_32",
              "size" : "536.9 MB",
              "size_in_bytes" : 536870912,
              "volume_uuid" : "0A519004-FDF2-3BDA-9650-613B11B95AFF"
            },
            {
              "_name" : "disk4s2",
              "bsd_name" : "disk4s2",
              "iocontent" : "Linux",
              "size" : "5.3 GB",
              "size_in_bytes" : 5297405952
            }
          ]
        }
      ],
      "_name" : "spcardreader",
      "spcardreader_device-id" : "0x9755",
      "spcardreader_link-width" : "x63",
      "spcardreader_revision-id" : "0x0001",
      "spcardreader_subsystem_vendor-id" : "0x17a0",
      "spcardreader_subsystem-id" : "0x9755",
      "spcardreader_vendor-id" : "0x17a0"
    }
  ]
}
#+end_example

That gives me a =jq= query of:

#+begin_src shell :results output :cache yes
system_profiler SPCardReaderDataType -json \
  | jq -r \
      '.SPCardReaderDataType[]._items[].bsd_name'
#+end_src

#+RESULTS[5d314c1c2ca22f8f1ad1b585a0b6bf4660495331]:
: disk4

This leaves me with a final script for =sd-card-dev-find.sh= of:

#+begin_src shell :results none :exports code
#!/usr/bin/env bash
##
# Finds the device file for the attached SD card (eg. /dev/disk4).  It will
# assume /dev as a relative directory to make consumption easier.
#
# This has a non-zero exit code if more than one disk is found, or no disks are
# found.
##

set -euo pipefail

while true; do
  case "${1:-}" in
    -h | --help)
      cat <<EOH
Usage: $0

Finds the device file for the attached SD card (eg. /dev/disk4).  It will
assume /dev as a relative directory to make consumption easier.
EOH
      exit
      ;;
    * ) break ;;
  esac
done

IFS=$'\n'
result=$(
  system_profiler SPCardReaderDataType -json \
    | jq -r \
      '.SPCardReaderDataType[]._items[].bsd_name'
)
array=( $result )
unset IFS
count="${#array[*]}"
if [[ $count != 1 ]]; then
  echo "Error: Query result '$result' has $count results but we expect exactly \
1." 1>&2
  exit 1
else
  echo -n $result
fi
#+end_src

Which also includes =-h= / =--help= and a comment describing how it works.  It
might seem obvious, and it is, but that's because it's fresh.  I've made life
easier for future-me.

Here's the same treatment for =image-create.sh=:

#+begin_src shell :results none :exports code
#!/usr/bin/env bash
##
# Creates a bootable Raspberry Pi image with NixOS.  This image should contain
# the entirety of the configuration, sans password updates (until I can get
# secret management going).
#
# The image file name is printed upon success.
##

set -euo pipefail

while true; do
  case "${1:-}" in
    -h | --help)
      cat <<EOH
Usage: $0

Creates a bootable Raspberry Pi image with NixOS.  This image should contain
the entirety of the configuration, sans password updates (until I can get
secret management going).

The image file name is printed upon success.
EOH
      exit
      ;;
    * ) break ;;
  esac
done

image_name='nixos-pi-sd-image.img'
./with-podman.sh " \
nix \
  --extra-experimental-features nix-command \
  --extra-experimental-features flakes \
  build '.#iron'
ls -al \$(readlink result)/nix-support
cp \$(readlink result)/sd-image/* /workdir/$image_name.zst
rm result
"
unzstd \
  --force \
  --decompress $image_name.zst \
  -o $image_name
rm --force $image_name.zst
hdiutil imageinfo $image_name

echo 'Image built successfully.' 1>&2
# Print the name used so we can use it elsewhere, and scripts needn't be tightly
# coupled.
echo $image_name
#+end_src

And I further broke things apart, such that =image-deploy.sh= actually installs
it.  I have done this because building the image is its own ordeal, and
something I might want to test separately.  Note that =image-create.sh= prints
the file name of the image so =image-deploy.sh= can use it, and doesn't need to
have intimate knowledge of the file name.  I have one place I can change the
image file name (or parameterize it), and nothing else needs to be updated.
