nix-adventures-01.html
<div id="outline-container-building-the-image--building-the-nixos-pi-image--extracting-the-image" class="outline-4">
<h4 id="building-the-image--building-the-nixos-pi-image--extracting-the-image"><span class="section-number-4">7.3.3.</span> Extracting the Image</h4>
<div class="outline-text-4" id="text-building-the-image--building-the-nixos-pi-image--extracting-the-image">
<p>
I quickly discovered that the symlink is orphaned.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org810bf3e"><span style="color: #FCCE7B;">ls</span> -al $<span style="color: #51afef;">(</span>readlink result<span style="color: #51afef;">)</span> <span style="color: #e69055; font-weight: bold;">2</span>&gt;&amp;<span style="color: #e69055; font-weight: bold;">1</span>
</pre>
</div>

<pre class="example">
ls: cannot access '/nix/store/dv21jmin4aqq4m0zvlbfbw2d6c1d47sr-nixos-sd-image-24.05.20231222.6df37dc-aarch64-linux.img': No such file or directory
</pre>


<p>
I bet there is some <code>containerd</code> trickery going on here.  Here&rsquo;s what I think
is happening:
</p>

<ol class="org-ol">
<li>I know from my script in <code>with-podman.sh</code>, the container is volume-mounting
<code>$HOME</code>.  It is <span class="underline">not</span> volume mounting <code>/nix</code>.</li>
<li>The file is actually written to <code>/nix</code> in the container.  This is
inaccessible to me once the container is shut down.</li>
<li>The symlink emitted isn&rsquo;t translated to whatever temporary file that podman
is actually writing to.</li>
<li>Thus I am left with a dead symlink.</li>
</ol>

<p>
I think the way we can fix this is to copy the image and then remove symlink (to
keep things clean, it&rsquo;s not strictly necessary).
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">" \</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  build '.#iron'</span>
<span style="color: #7bc275;">cp</span><span style="color: #7bc275;"> \$(readlink result) /workdir/nixos-pi.img</span>
<span style="color: #7bc275;">rm</span><span style="color: #7bc275;"> result</span>
<span style="color: #7bc275;">"</span>
</pre>
</div>

<p>
This doesn&rsquo;t work because the symlink points a directory, and not the image file
itself.  I did some digging and found I can do this:
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">" \</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  build '.#iron'</span>
<span style="color: #7bc275;">cp</span><span style="color: #7bc275;"> \$(readlink result)/sd-image/* /workdir/nixos-pi.img.zst</span>
<span style="color: #7bc275;">rm</span><span style="color: #7bc275;"> result</span>
<span style="color: #7bc275;">"</span>
</pre>
</div>

<p>
Note the added <code>.zst</code>.  Also there is another directory adjacent to <code>sd-image</code>
called <code>nix-support</code>.  I&rsquo;ll take a look at that as I do more runs.
</p>

<p>
I do need to add the ability to decompress this image in preparation for <code>dd</code>.
Let&rsquo;s yank our earlier invocation and place it in this command chain.  If I
wanted to muck around with the container image itself, I could use
the <code>unzstd</code> invocation to specify an output directory, which means we avoid a
<code>cp</code> of the entire image.  I don&rsquo;t want to muck around with the container image
as much as I can though.
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">" \</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  build '.#iron'</span>
<span style="color: #7bc275;">ls</span><span style="color: #7bc275;"> -al \$(readlink result)/nix-support</span>
<span style="color: #7bc275;">cp</span><span style="color: #7bc275;"> \$(readlink result)/sd-image/* /workdir/nixos-pi-sd-image.img.zst</span>
<span style="color: #7bc275;">rm</span><span style="color: #7bc275;"> result</span>
<span style="color: #7bc275;">"</span>
unzstd -d nixos-pi-sd-image.img.zst -o nixos-pi-sd-image.img
</pre>
</div>

<p>
One of the things I really like about this journaled approach to exploration is
that it slows me down enough to ask questions that make me avoid pitfalls.  As I
am writing, I am thinking &ldquo;How do I know the result from <code>unzstd</code> is <span class="underline">actually</span>
a valid image without having to push it through <code>dd</code> and then slotting the card
into the Pi?
</p>

<p>
Some quick searching reveals I can use <code>hdiutil imageinfo &lt;file&gt;</code> to get this
information.
</p>

<p>
Let&rsquo;s see if it tells us that it is <span class="underline">not</span> looking at a valid image:
</p>

<div class="org-src-container">
<pre class="src src-shell">hdiutil imageinfo nixos-pi-sd-image.img.zst <span style="color: #e69055; font-weight: bold;">2</span>&gt;&amp;<span style="color: #e69055; font-weight: bold;">1</span>
<span style="color: #FCCE7B;">echo</span> $<span style="color: #dcafe9;">?</span>
</pre>
</div>

<pre class="example">
hdiutil: imageinfo failed - image not recognized
1
</pre>


<p>
Excellent!  And the positive case?
</p>

<div class="org-src-container">
<pre class="src src-shell">hdiutil imageinfo nixos-pi-sd-image.img <span style="color: #e69055; font-weight: bold;">2</span>&gt;&amp;<span style="color: #e69055; font-weight: bold;">1</span>
<span style="color: #FCCE7B;">echo</span> $<span style="color: #dcafe9;">?</span>
</pre>
</div>

<pre class="example" id="org40d8bba">
Class Name: CRawDiskImage
Size Information:
	Total Bytes: 2829352960
	Compressed Ratio: 1
	Sector Count: 5526080
	Total Non-Empty Bytes: 2829352960
	Compressed Bytes: 2829352960
	Total Empty Bytes: 0
Checksum Type: none
Format: UDRW
partitions:
	partition-scheme: fdisk
	block-size: 512
	partitions:
		0:
			partition-name: Master Boot Record
			partition-start: 0
			partition-synthesized: true
			partition-length: 1
			partition-hint: MBR
			boot-code: 0x00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000004E6978210000
		1:
			partition-name:
			partition-start: 1
			partition-synthesized: true
			partition-length: 16383
			partition-hint: Apple_Free
		2:
			partition-start: 16384
			partition-number: 1
			partition-length: 61440
			partition-hint: DOS_FAT_32
			partition-filesystems:
				FAT16: FIRMWARE
		3:
			partition-start: 77824
			partition-number: 2
			partition-length: 5448256
			partition-hint: Linux_Ext2FS
	burnable: false
Format Description: raw read/write
Checksum Value:
Properties:
	Encrypted: false
	Kernel Compatible: true
	Checksummed: false
	Software License Agreement: false
	Partitioned: false
	Compressed: no
Segments:
	0: /Users/logan/dev/proton-nix/nixos-pi-sd-image.img
Backing Store Information:
	URL: file:///Users/logan/dev/proton-nix/nixos-pi-sd-image.img
	Name: nixos-pi-sd-image.img
	Class Name: CBSDBackingStore
Resize limits (per hdiutil resize -limits):
5526080	5526080	181452016
0
</pre>

<p>
Wonderful!
</p>

<p>
We can incorporate that into our eventual script we&rsquo;ll be creating, just to
check on things.
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">" \</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  build '.#iron'</span>
<span style="color: #7bc275;">ls</span><span style="color: #7bc275;"> -al \$(readlink result)/nix-support</span>
<span style="color: #7bc275;">cp</span><span style="color: #7bc275;"> \$(readlink result)/sd-image/* /workdir/nixos-pi-sd-image.img.zst</span>
<span style="color: #7bc275;">rm</span><span style="color: #7bc275;"> result</span>
<span style="color: #7bc275;">"</span>
unzstd -d nixos-pi-sd-image.img.zst -o nixos-pi-sd-image.img
<span style="color: #FCCE7B;">rm</span> nixos-pi-sd-image.img.zst
hdiutil imageinfo nixos-pi-sd-image.img
</pre>
</div>

<p>
And then we can incorporate the <code>dd</code> invocation into it:
</p>

<div class="org-src-container">
<pre class="src src-shell">./with-podman.sh <span style="color: #7bc275;">" \</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  build '.#iron'</span>
<span style="color: #7bc275;">ls</span><span style="color: #7bc275;"> -al \$(readlink result)/nix-support</span>
<span style="color: #7bc275;">cp</span><span style="color: #7bc275;"> \$(readlink result)/sd-image/* /workdir/nixos-pi-sd-image.img.zst</span>
<span style="color: #7bc275;">rm</span><span style="color: #7bc275;"> result</span>
<span style="color: #7bc275;">"</span>
unzstd -d nixos-pi-sd-image.img.zst -o nixos-pi-sd-image.img
<span style="color: #FCCE7B;">rm</span> nixos-pi-sd-image.img.zst
hdiutil imageinfo nixos-pi-sd-image.img
<span style="color: #FCCE7B;">sudo</span> dd <span style="color: #dcafe9;">if</span>=nixos-pi-sd-image.img <span style="color: #dcafe9;">of</span>=/dev/disk4 <span style="color: #dcafe9;">bs</span>=1M <span style="color: #dcafe9;">status</span>=progress <span style="color: #dcafe9;">conv</span>=fsync
</pre>
</div>

<p>
Let&rsquo;s not run that yet, because just blindly doing <code>dd</code> on things under <code>/dev</code>
is inherently dangerous.  Is there a way we can query for a detachable disk?
</p>

<p>
There is for macOS, but it&rsquo;s not portable.  I have seen some mention that
<code>lsusb</code> works for non-USB storage devices (and by extension, <code>cyme</code> would as
well), but I have not observed that on my system.  Still, learning of <code>cyme</code> is
useful and it&rsquo;s been added to my toolbox for later.
</p>

<p>
This is what I came up with:
</p>

<div class="org-src-container">
<pre class="src src-shell">system_profiler SPStorageDataType -json <span style="color: #7bc275;">\</span>
  | jq -r <span style="color: #7bc275;">\</span>
      <span style="color: #7bc275;">'.SPStorageDataType.[]</span>
<span style="color: #7bc275;">        | select(.physical_drive.protocol == "Secure Digital")</span>
<span style="color: #7bc275;">        | .bsd_name'</span> <span style="color: #7bc275;">\</span>
  | sed -E <span style="color: #7bc275;">'s/s[0-9]+//'</span>
</pre>
</div>

<p>
Note that this might not work if using a USB attached SD card.  This could be
the case if you&rsquo;re using a docking station setup on your Mac/MacBook, instead of
preferring the on-board SD card reader.
</p>

<p>
Okay so now we have the disk, dynamically.  We can just idiotically bail out if
more than one is found.  We should only find one and only one result.
</p>

<p>
Ugh.  I really wish we could actually replace Bash with a stronger scripting
language but with the same level of ubiquitousness.  This is what I was able to
put together for giving me a one-and-only-one search:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #62686E;">#</span><span style="color: #62686E;">!/usr/bin/</span><span style="color: #51afef;">env</span><span style="color: #62686E;"> bash</span>

<span style="color: #C57BDB;">set</span> -euo pipefail

<span style="color: #dcafe9;">IFS</span>=$<span style="color: #7bc275;">'\n'</span>
<span style="color: #dcafe9;">result</span>=<span style="color: #51afef;">(</span> $<span style="color: #C57BDB;">(</span>system_profiler SPStorageDataType -json <span style="color: #7bc275;">\</span>
  | jq -r <span style="color: #7bc275;">\</span>
      <span style="color: #7bc275;">'.SPStorageDataType.[]</span>
<span style="color: #7bc275;">        | select(.physical_drive.protocol == "Secure Digital")</span>
<span style="color: #7bc275;">        | .bsd_name'</span> <span style="color: #7bc275;">\</span>
  | sed -E <span style="color: #7bc275;">'s/s[0-9]+//'</span>
<span style="color: #C57BDB;">)</span> <span style="color: #51afef;">)</span>
<span style="color: #C57BDB;">unset</span> IFS
<span style="color: #dcafe9;">count</span>=<span style="color: #7bc275;">"</span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">{#result[*]}</span><span style="color: #7bc275;">"</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span><span style="color: #C57BDB;">[</span> $<span style="color: #dcafe9;">count</span> != <span style="color: #e69055; font-weight: bold;">1</span> <span style="color: #C57BDB;">]</span><span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
  <span style="color: #FCCE7B;">echo</span> <span style="color: #7bc275;">"Error: </span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">result</span><span style="color: #7bc275;"> has </span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">count</span><span style="color: #7bc275;"> results but we expect exactly 1."</span> <span style="color: #e69055; font-weight: bold;">1</span>&gt;&amp;<span style="color: #e69055; font-weight: bold;">2</span>
  <span style="color: #51afef;">exit</span> <span style="color: #e69055; font-weight: bold;">1</span>
<span style="color: #51afef;">else</span>
  <span style="color: #FCCE7B;">echo</span> -n $<span style="color: #dcafe9;">result</span>
<span style="color: #51afef;">fi</span>
</pre>
</div>

<p>
I tested with 1 device and 4 devices, and got the results I wanted.
</p>

<p>
This leaves us with a final script of:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #62686E;">#</span><span style="color: #62686E;">!/usr/bin/</span><span style="color: #51afef;">env</span><span style="color: #62686E;"> bash</span>

./with-podman.sh <span style="color: #7bc275;">" \</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  build '.#iron'</span>
<span style="color: #7bc275;">ls</span><span style="color: #7bc275;"> -al \$(readlink result)/nix-support</span>
<span style="color: #7bc275;">cp</span><span style="color: #7bc275;"> \$(readlink result)/sd-image/* /workdir/nixos-pi-sd-image.img.zst</span>
<span style="color: #7bc275;">rm</span><span style="color: #7bc275;"> result</span>
<span style="color: #7bc275;">"</span>
unzstd -d nixos-pi-sd-image.img.zst -o nixos-pi-sd-image.img
<span style="color: #FCCE7B;">rm</span> nixos-pi-sd-image.img.zst
hdiutil imageinfo nixos-pi-sd-image.img
<span style="color: #FCCE7B;">sudo</span> dd <span style="color: #7bc275;">\</span>
     <span style="color: #dcafe9;">if</span>=nixos-pi-sd-image.img <span style="color: #7bc275;">\</span>
     <span style="color: #dcafe9;">of</span>=/dev/$<span style="color: #51afef;">(</span>./sd-card-dev-find.sh<span style="color: #51afef;">)</span> <span style="color: #7bc275;">\</span>
     <span style="color: #dcafe9;">bs</span>=1M <span style="color: #7bc275;">\</span>
     <span style="color: #dcafe9;">status</span>=progress <span style="color: #7bc275;">\</span>
     <span style="color: #dcafe9;">conv</span>=fsync
</pre>
</div>

<p>
I found as part of futzing with this that <code>SPStorageDataType</code> only works for
mounted devices but not available devices.  However I need things to be
unmounted to use <code>dd</code> on them.  This does not make it easy to do ephemeral runs.
If I wanted to always use <code>SPStorageDataType</code>, then I&rsquo;d need to know <span class="underline">what</span> to
mount, which is what I&rsquo;m trying to determine in the first place.  Additionally,
the disk might be totally fresh or using some unknown filesystem - both of which
would render the device unmountable.  With some checking around from
<code>system_profiler -listDataTypes</code> I found <code>SPCardReaderDataType</code> which looks
promising:
</p>

<div class="org-src-container">
<pre class="src src-shell">system_profiler SPCardReaderDataType
</pre>
</div>

<p>
And now the JSON form:
</p>


<div class="org-src-container">
<pre class="src src-shell">system_profiler SPCardReaderDataType -json
</pre>
</div>

<p>
That gives me a <code>jq</code> query of:
</p>

<div class="org-src-container">
<pre class="src src-shell">system_profiler SPCardReaderDataType -json <span style="color: #7bc275;">\</span>
  | jq -r <span style="color: #7bc275;">\</span>
      <span style="color: #7bc275;">'.SPCardReaderDataType[]._items[].bsd_name'</span>
</pre>
</div>

<p>
This leaves me with a final script for <code>sd-card-dev-find.sh</code> of:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #62686E;">#</span><span style="color: #62686E;">!/usr/bin/</span><span style="color: #51afef;">env</span><span style="color: #62686E;"> bash</span>
<span style="color: #62686E;">##</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">Finds the device file for the attached SD card (eg. /dev/disk4).  It will</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">assume /dev as a relative directory to </span><span style="color: #62686E;">make</span><span style="color: #62686E;"> consumption easier.</span>
<span style="color: #62686E;">#</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">This has a non-zero exit code if more than one disk is found, or no disks are</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">found.</span>
<span style="color: #62686E;">##</span>

<span style="color: #C57BDB;">set</span> -euo pipefail

<span style="color: #51afef;">while </span><span style="color: #C57BDB;">true</span>; <span style="color: #51afef;">do</span>
  <span style="color: #51afef;">case</span> <span style="color: #7bc275;">"</span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">{1:-}</span><span style="color: #7bc275;">"</span><span style="color: #51afef;"> in</span>
    -h | --help)
      <span style="color: #FCCE7B;">cat</span> &lt;&lt;EOH
<span style="color: #7bc275;">Usage: $0</span>

<span style="color: #7bc275;">Finds the device file for the attached SD card (eg. /dev/disk4).  It will</span>
<span style="color: #7bc275;">assume /dev as a relative directory to </span><span style="color: #7bc275;">make</span><span style="color: #7bc275;"> consumption easier.</span>
<span style="color: #7bc275;">EOH</span>
      <span style="color: #51afef;">exit</span>
      ;;
    * ) <span style="color: #51afef;">break</span> ;;
  <span style="color: #51afef;">esac</span>
<span style="color: #51afef;">done</span>

<span style="color: #dcafe9;">IFS</span>=$<span style="color: #7bc275;">'\n'</span>
<span style="color: #dcafe9;">result</span>=$<span style="color: #51afef;">(</span>
  system_profiler SPCardReaderDataType -json <span style="color: #7bc275;">\</span>
    | jq -r <span style="color: #7bc275;">\</span>
      <span style="color: #7bc275;">'.SPCardReaderDataType[]._items[].bsd_name'</span>
<span style="color: #51afef;">)</span>
<span style="color: #dcafe9;">array</span>=<span style="color: #51afef;">(</span> $<span style="color: #dcafe9;">result</span> <span style="color: #51afef;">)</span>
<span style="color: #C57BDB;">unset</span> IFS
<span style="color: #dcafe9;">count</span>=<span style="color: #7bc275;">"</span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">{#array[*]}</span><span style="color: #7bc275;">"</span>
<span style="color: #51afef;">if</span> <span style="color: #51afef;">[</span><span style="color: #C57BDB;">[</span> $<span style="color: #dcafe9;">count</span> != <span style="color: #e69055; font-weight: bold;">1</span> <span style="color: #C57BDB;">]</span><span style="color: #51afef;">]</span>; <span style="color: #51afef;">then</span>
  <span style="color: #FCCE7B;">echo</span> <span style="color: #7bc275;">"Error: Query result '</span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">result</span><span style="color: #7bc275;">' has </span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">count</span><span style="color: #7bc275;"> results but we expect exactly \</span>
<span style="color: #7bc275;">1."</span> <span style="color: #e69055; font-weight: bold;">1</span>&gt;&amp;<span style="color: #e69055; font-weight: bold;">2</span>
  <span style="color: #51afef;">exit</span> <span style="color: #e69055; font-weight: bold;">1</span>
<span style="color: #51afef;">else</span>
  <span style="color: #FCCE7B;">echo</span> -n $<span style="color: #dcafe9;">result</span>
<span style="color: #51afef;">fi</span>
</pre>
</div>

<p>
Which also includes <code>-h</code> / <code>--help</code> and a comment describing how it works.  It
might seem obvious, and it is, but that&rsquo;s because it&rsquo;s fresh.  I&rsquo;ve made life
easier for future-me.
</p>

<p>
Here&rsquo;s the same treatment for <code>image-create.sh</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #62686E;">#</span><span style="color: #62686E;">!/usr/bin/</span><span style="color: #51afef;">env</span><span style="color: #62686E;"> bash</span>
<span style="color: #62686E;">##</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">Creates a bootable Raspberry Pi image with NixOS.  This image should contain</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">the entirety of the configuration, sans password updates (until I can get</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">secret management going).</span>
<span style="color: #62686E;">#</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">The image file name is printed upon success.</span>
<span style="color: #62686E;">##</span>

<span style="color: #C57BDB;">set</span> -euo pipefail

<span style="color: #51afef;">while </span><span style="color: #C57BDB;">true</span>; <span style="color: #51afef;">do</span>
  <span style="color: #51afef;">case</span> <span style="color: #7bc275;">"</span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">{1:-}</span><span style="color: #7bc275;">"</span><span style="color: #51afef;"> in</span>
    -h | --help)
      <span style="color: #FCCE7B;">cat</span> &lt;&lt;EOH
<span style="color: #7bc275;">Usage: $0</span>

<span style="color: #7bc275;">Creates a bootable Raspberry Pi image with NixOS.  This image should contain</span>
<span style="color: #7bc275;">the entirety of the configuration, sans password updates (until I can get</span>
<span style="color: #7bc275;">secret management going).</span>

<span style="color: #7bc275;">The image file name is printed upon success.</span>
<span style="color: #7bc275;">EOH</span>
      <span style="color: #51afef;">exit</span>
      ;;
    * ) <span style="color: #51afef;">break</span> ;;
  <span style="color: #51afef;">esac</span>
<span style="color: #51afef;">done</span>

<span style="color: #dcafe9;">image_name</span>=<span style="color: #7bc275;">'nixos-pi-sd-image.img'</span>
./with-podman.sh <span style="color: #7bc275;">" \</span>
<span style="color: #7bc275;">nix \</span>
<span style="color: #7bc275;">  --extra-experimental-features nix-command \</span>
<span style="color: #7bc275;">  --extra-experimental-features flakes \</span>
<span style="color: #7bc275;">  build '.#iron'</span>
<span style="color: #7bc275;">ls</span><span style="color: #7bc275;"> -al \$(readlink result)/nix-support</span>
<span style="color: #7bc275;">cp</span><span style="color: #7bc275;"> \$(readlink result)/sd-image/* /workdir/</span><span style="color: #a991f1;">$</span><span style="color: #dcafe9;">image_name</span><span style="color: #7bc275;">.zst</span>
<span style="color: #7bc275;">rm</span><span style="color: #7bc275;"> result</span>
<span style="color: #7bc275;">"</span>
unzstd <span style="color: #7bc275;">\</span>
  --force <span style="color: #7bc275;">\</span>
  --decompress $<span style="color: #dcafe9;">image_name</span>.zst <span style="color: #7bc275;">\</span>
  -o $<span style="color: #dcafe9;">image_name</span>
<span style="color: #FCCE7B;">rm</span> --force $<span style="color: #dcafe9;">image_name</span>.zst
hdiutil imageinfo $<span style="color: #dcafe9;">image_name</span>

<span style="color: #FCCE7B;">echo</span> <span style="color: #7bc275;">'Image built successfully.'</span> <span style="color: #e69055; font-weight: bold;">1</span>&gt;&amp;<span style="color: #e69055; font-weight: bold;">2</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">Print the name used so we can use it elsewhere, and scripts needn't be tightly</span>
<span style="color: #62686E;"># </span><span style="color: #62686E;">coupled.</span>
<span style="color: #FCCE7B;">echo</span> $<span style="color: #dcafe9;">image_name</span>
</pre>
</div>

<p>
And I further broke things apart, such that <code>image-deploy.sh</code> actually installs
it.  I have done this because building the image is its own ordeal, and
something I might want to test separately.  Note that <code>image-create.sh</code> prints
the file name of the image so <code>image-deploy.sh</code> can use it, and doesn&rsquo;t need to
have intimate knowledge of the file name.  I have one place I can change the
image file name (or parameterize it), and nothing else needs to be updated.
</p>
</div>
</div>
</div>
