nix-adventures-01.org
** No Joy on Boot
:PROPERTIES:
:CUSTOM_ID: building-the-image--no-joy-on-boot
:END:

The Pi seems to "boot", but results in the double-green flashes I had before I
went down the NixOS image approach.  I happen to have a second Pi with me, and
have tried it there, as well as a second card with the same image.  I don't feel
like this has ruled out hardware problems.

My card is from SanDisk, and is the SanDisk Ultra 128GB microSDXC UHS-I Card
(=SDSQUNC-128G-GN6MA=) variant.  https://elinux.org/RPi_SD_cards indicates that
this should work.  Many of the recent SanDisk cards are reported as working.
The Amazon reviews say that they specifically work for Raspberry Pis as well.
Even though I got them from the same batch (as well as the Pis), I _suspect_
this is not a hardware issue, but I haven't ruled it out.

I need a display to see if there's some other critical information before I can
continue.

I did install =f3= utilities to test it (with =f3read= and =f3write=) but I
haven't taken them for a spin yet.

** Back, and Display Ports
:PROPERTIES:
:CUSTOM_ID: building-the-image--back-and-display-ports
:END:

My travels are now complete, and I'm able to inspect things with my home
network.  A curious thing that came up was the displays ports.  The new
(circa 2023) Raspberry Pi's come with micro-HDMI connections for display.  I did
some searching around and found that HDMI actually requires royalties are paid
(perhaps the Pis are exempt?) at the cost of $0.15 USD or $0.05 (or lower) if
the HDMI logo is displayed per [[https://en.wikipedia.org/wiki/HDMI#HDMI_fee_structure][Wikipedia's HDMI article]].  The Pi has the logo
printed on PCB.  The capabilities between HDMI. are on par with each other, from
what various posts I could find.  Apologists have reported that HDMI is more
universal, and thus more in line with the goals of the Pi to make cheaply
accessible computers.  I still had to buy an adapter to connect it to any of my
displays made in the last 10 years.  Granted, the adapter wasn't terribly
expensive.  It did halt my work though.  Now I have one, and a display to
connect it to.  The results were surprising!

** Actually Joy on Boot
:PROPERTIES:
:CUSTOM_ID: building-the-image--actually-joy-on-boot
:END:

I can see the Pi has actually booted up, and it works!  It successfully boots,
and the flashing green light must just be "activity" that is on some regular
interval.  The Bluetooth or WiFi radio, perhaps?  Either way, I have a working
Pi!  Let's see if I can log in.

#+begin_example
$ ssh iron.proton
The authenticity of host 'iron.proton (192.168.254.102)' can't be established.
ED25519 key fingerprint is SHA256:E3b/T0lQiqItcIKbh2n6Wb/sOEV9nFbrVojJXlKmHrQ.
This key is not known by any other names.
Are you sure you want to continue connecting (yes/no/[fingerprint])? yes
Warning: Permanently added 'iron.proton' (ED25519) to the list of known hosts.

[logan@iron:~]$
#+end_example

Wow!  I'd forgotten I'd added one of my authorized keys to the list.  I have to
admit, I'm pretty giddy.  I do have a password to update.  A quick =passwd=
invocation shows the =initialPassword= field is good, but you won't see
anything interesting here:

#+begin_example
[logan@iron:~]$ passwd
Changing password for logan.
Current password:
New password:
Retype new password:
passwd: password updated successfully
#+end_example

And then to see if I can use =sudo=:

#+begin_example
[logan@iron:~]$ sudo ls

We trust you have received the usual lecture from the local System
Administrator. It usually boils down to these three things:

    #1) Respect the privacy of others.
    #2) Think before you type.
    #3) With great power comes great responsibility.

For security reasons, the password you type will not be visible.

[sudo] password for logan:

[logan@iron:~]$
#+end_example

So this ticks all of my boxes for getting a Pi
configured on the baseline, but lets go through the list to be sure:

+ [X] The Pi has the desired hostname.
+ [X] The Pi has my user.
+ [X] My user can be logged into via SSH.
+ [X] My user is a sudoer.

That's everything!

* Conclusion
:PROPERTIES:
:CUSTOM_ID: conclusion
:END:

I'll wrap this up here.  The next part of this adventure will be to get
Wireguard configured on the Pi.  That's a bit beyond the scope of what I feel
safe sharing here.

I have noticed during my searching about that there are
these =age= secrets that I intend to read up on, though I find it hard to
believe these secrets are safely shared on public repositories.  Offline brute
force attacks are highly effective, from what I understand.
