nix-adventures-01.html
<div id="outline-container-building-the-image--no-joy-on-boot" class="outline-3">
<h3 id="building-the-image--no-joy-on-boot"><span class="section-number-3">7.4.</span> No Joy on Boot</h3>
<div class="outline-text-3" id="text-building-the-image--no-joy-on-boot">
<p>
The Pi seems to &ldquo;boot&rdquo;, but results in the double-green flashes I had before I
went down the NixOS image approach.  I happen to have a second Pi with me, and
have tried it there, as well as a second card with the same image.  I don&rsquo;t feel
like this has ruled out hardware problems.
</p>

<p>
My card is from SanDisk, and is the SanDisk Ultra 128GB microSDXC UHS-I Card
(<code>SDSQUNC-128G-GN6MA</code>) variant.  <a href="https://elinux.org/RPi_SD_cards">https://elinux.org/RPi_SD_cards</a> indicates that
this should work.  Many of the recent SanDisk cards are reported as working.
The Amazon reviews say that they specifically work for Raspberry Pis as well.
Even though I got them from the same batch (as well as the Pis), I <span class="underline">suspect</span>
this is not a hardware issue, but I haven&rsquo;t ruled it out.
</p>

<p>
I need a display to see if there&rsquo;s some other critical information before I can
continue.
</p>

<p>
I did install <code>f3</code> utilities to test it (with <code>f3read</code> and <code>f3write</code>) but I
haven&rsquo;t taken them for a spin yet.
</p>
</div>
</div>
<div id="outline-container-building-the-image--back-and-display-ports" class="outline-3">
<h3 id="building-the-image--back-and-display-ports"><span class="section-number-3">7.5.</span> Back, and Display Ports</h3>
<div class="outline-text-3" id="text-building-the-image--back-and-display-ports">
<p>
My travels are now complete, and I&rsquo;m able to inspect things with my home
network.  A curious thing that came up was the displays ports.  The new
(circa 2023) Raspberry Pi&rsquo;s come with micro-HDMI connections for display.  I did
some searching around and found that HDMI actually requires royalties are paid
(perhaps the Pis are exempt?) at the cost of $0.15 USD or $0.05 (or lower) if
the HDMI logo is displayed per <a href="https://en.wikipedia.org/wiki/HDMI#HDMI_fee_structure">Wikipedia&rsquo;s HDMI article</a>.  The Pi has the logo
printed on PCB.  The capabilities between HDMI. are on par with each other, from
what various posts I could find.  Apologists have reported that HDMI is more
universal, and thus more in line with the goals of the Pi to make cheaply
accessible computers.  I still had to buy an adapter to connect it to any of my
displays made in the last 10 years.  Granted, the adapter wasn&rsquo;t terribly
expensive.  It did halt my work though.  Now I have one, and a display to
connect it to.  The results were surprising!
</p>
</div>
</div>
<div id="outline-container-building-the-image--actually-joy-on-boot" class="outline-3">
<h3 id="building-the-image--actually-joy-on-boot"><span class="section-number-3">7.6.</span> Actually Joy on Boot</h3>
<div class="outline-text-3" id="text-building-the-image--actually-joy-on-boot">
<p>
I can see the Pi has actually booted up, and it works!  It successfully boots,
and the flashing green light must just be &ldquo;activity&rdquo; that is on some regular
interval.  The Bluetooth or WiFi radio, perhaps?  Either way, I have a working
Pi!  Let&rsquo;s see if I can log in.
</p>

<pre class="example" id="org75a4445">
$ ssh iron.proton
The authenticity of host 'iron.proton (192.168.254.102)' can't be established.
ED25519 key fingerprint is SHA256:E3b/T0lQiqItcIKbh2n6Wb/sOEV9nFbrVojJXlKmHrQ.
This key is not known by any other names.
Are you sure you want to continue connecting (yes/no/[fingerprint])? yes
Warning: Permanently added 'iron.proton' (ED25519) to the list of known hosts.

[logan@iron:~]$
</pre>

<p>
Wow!  I&rsquo;d forgotten I&rsquo;d added one of my authorized keys to the list.  I have to
admit, I&rsquo;m pretty giddy.  I do have a password to update.  A quick <code>passwd</code>
invocation shows the <code>initialPassword</code> field is good, but you won&rsquo;t see
anything interesting here:
</p>

<pre class="example" id="org0869fd0">
[logan@iron:~]$ passwd
Changing password for logan.
Current password:
New password:
Retype new password:
passwd: password updated successfully
</pre>

<p>
And then to see if I can use <code>sudo</code>:
</p>

<pre class="example" id="org5fb67bb">
[logan@iron:~]$ sudo ls

We trust you have received the usual lecture from the local System
Administrator. It usually boils down to these three things:

    #1) Respect the privacy of others.
    #2) Think before you type.
    #3) With great power comes great responsibility.

For security reasons, the password you type will not be visible.

[sudo] password for logan:

[logan@iron:~]$
</pre>

<p>
So this ticks all of my boxes for getting a Pi
configured on the baseline, but lets go through the list to be sure:
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> The Pi has the desired hostname.</li>
<li class="on"><code>[X]</code> The Pi has my user.</li>
<li class="on"><code>[X]</code> My user can be logged into via SSH.</li>
<li class="on"><code>[X]</code> My user is a sudoer.</li>
</ul>

<p>
That&rsquo;s everything!
</p>
</div>
</div>
</div>
<div id="outline-container-conclusion" class="outline-2">
<h2 id="conclusion"><span class="section-number-2">8.</span> Conclusion</h2>
<div class="outline-text-2" id="text-conclusion">
<p>
I&rsquo;ll wrap this up here.  The next part of this adventure will be to get
Wireguard configured on the Pi.  That&rsquo;s a bit beyond the scope of what I feel
safe sharing here.
</p>

<p>
I have noticed during my searching about that there are
these <code>age</code> secrets that I intend to read up on, though I find it hard to
believe these secrets are safely shared on public repositories.  Offline brute
force attacks are highly effective, from what I understand.
</p>
</div>
</div>
